Microchip-MPLAB-Harmony/touch_apps/apps/qt8_selfcap_surface_xpro_board/pic32cm_pl10_cnano_water_tolerance/firmware/src/packs/PIC32CM6408PL10048_DFP/component/port.h
/*
 * Component description for PORT
 *
 * Copyright (c) 2025 Microchip Technology Inc. and its subsidiaries.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/*      file generated from device description file (ATDF) version None       */
#ifndef _PIC32CMPL10_PORT_COMPONENT_H_
#define _PIC32CMPL10_PORT_COMPONENT_H_

#include "core_cm0plus.h"

/* ************************************************************************** */
/*                      SOFTWARE API DEFINITION FOR PORT                      */
/* ************************************************************************** */

/* -------- PORT_DIR : (PORT Offset: 0x00) (R/W 32) Data Direction -------- */
#define PORT_DIR_RESETVALUE                   _UINT32_(0x00)                                       /*  (PORT_DIR) Data Direction  Reset Value */

#define PORT_DIR_DIR0_Pos                     _UINT32_(0)                                          /* (PORT_DIR) Port Data Direction 0 Position */
#define PORT_DIR_DIR0_Msk                     (_UINT32_(0x1) << PORT_DIR_DIR0_Pos)                 /* (PORT_DIR) Port Data Direction 0 Mask */
#define PORT_DIR_DIR0(value)                  (PORT_DIR_DIR0_Msk & (_UINT32_(value) << PORT_DIR_DIR0_Pos)) /* Assignment of value for DIR0 in the PORT_DIR register */
#define PORT_DIR_DIR1_Pos                     _UINT32_(1)                                          /* (PORT_DIR) Port Data Direction 1 Position */
#define PORT_DIR_DIR1_Msk                     (_UINT32_(0x1) << PORT_DIR_DIR1_Pos)                 /* (PORT_DIR) Port Data Direction 1 Mask */
#define PORT_DIR_DIR1(value)                  (PORT_DIR_DIR1_Msk & (_UINT32_(value) << PORT_DIR_DIR1_Pos)) /* Assignment of value for DIR1 in the PORT_DIR register */
#define PORT_DIR_DIR2_Pos                     _UINT32_(2)                                          /* (PORT_DIR) Port Data Direction 2 Position */
#define PORT_DIR_DIR2_Msk                     (_UINT32_(0x1) << PORT_DIR_DIR2_Pos)                 /* (PORT_DIR) Port Data Direction 2 Mask */
#define PORT_DIR_DIR2(value)                  (PORT_DIR_DIR2_Msk & (_UINT32_(value) << PORT_DIR_DIR2_Pos)) /* Assignment of value for DIR2 in the PORT_DIR register */
#define PORT_DIR_DIR3_Pos                     _UINT32_(3)                                          /* (PORT_DIR) Port Data Direction 3 Position */
#define PORT_DIR_DIR3_Msk                     (_UINT32_(0x1) << PORT_DIR_DIR3_Pos)                 /* (PORT_DIR) Port Data Direction 3 Mask */
#define PORT_DIR_DIR3(value)                  (PORT_DIR_DIR3_Msk & (_UINT32_(value) << PORT_DIR_DIR3_Pos)) /* Assignment of value for DIR3 in the PORT_DIR register */
#define PORT_DIR_DIR4_Pos                     _UINT32_(4)                                          /* (PORT_DIR) Port Data Direction 4 Position */
#define PORT_DIR_DIR4_Msk                     (_UINT32_(0x1) << PORT_DIR_DIR4_Pos)                 /* (PORT_DIR) Port Data Direction 4 Mask */
#define PORT_DIR_DIR4(value)                  (PORT_DIR_DIR4_Msk & (_UINT32_(value) << PORT_DIR_DIR4_Pos)) /* Assignment of value for DIR4 in the PORT_DIR register */
#define PORT_DIR_DIR5_Pos                     _UINT32_(5)                                          /* (PORT_DIR) Port Data Direction 5 Position */
#define PORT_DIR_DIR5_Msk                     (_UINT32_(0x1) << PORT_DIR_DIR5_Pos)                 /* (PORT_DIR) Port Data Direction 5 Mask */
#define PORT_DIR_DIR5(value)                  (PORT_DIR_DIR5_Msk & (_UINT32_(value) << PORT_DIR_DIR5_Pos)) /* Assignment of value for DIR5 in the PORT_DIR register */
#define PORT_DIR_DIR6_Pos                     _UINT32_(6)                                          /* (PORT_DIR) Port Data Direction 6 Position */
#define PORT_DIR_DIR6_Msk                     (_UINT32_(0x1) << PORT_DIR_DIR6_Pos)                 /* (PORT_DIR) Port Data Direction 6 Mask */
#define PORT_DIR_DIR6(value)                  (PORT_DIR_DIR6_Msk & (_UINT32_(value) << PORT_DIR_DIR6_Pos)) /* Assignment of value for DIR6 in the PORT_DIR register */
#define PORT_DIR_DIR7_Pos                     _UINT32_(7)                                          /* (PORT_DIR) Port Data Direction 7 Position */
#define PORT_DIR_DIR7_Msk                     (_UINT32_(0x1) << PORT_DIR_DIR7_Pos)                 /* (PORT_DIR) Port Data Direction 7 Mask */
#define PORT_DIR_DIR7(value)                  (PORT_DIR_DIR7_Msk & (_UINT32_(value) << PORT_DIR_DIR7_Pos)) /* Assignment of value for DIR7 in the PORT_DIR register */
#define PORT_DIR_DIR8_Pos                     _UINT32_(8)                                          /* (PORT_DIR) Port Data Direction 8 Position */
#define PORT_DIR_DIR8_Msk                     (_UINT32_(0x1) << PORT_DIR_DIR8_Pos)                 /* (PORT_DIR) Port Data Direction 8 Mask */
#define PORT_DIR_DIR8(value)                  (PORT_DIR_DIR8_Msk & (_UINT32_(value) << PORT_DIR_DIR8_Pos)) /* Assignment of value for DIR8 in the PORT_DIR register */
#define PORT_DIR_DIR9_Pos                     _UINT32_(9)                                          /* (PORT_DIR) Port Data Direction 9 Position */
#define PORT_DIR_DIR9_Msk                     (_UINT32_(0x1) << PORT_DIR_DIR9_Pos)                 /* (PORT_DIR) Port Data Direction 9 Mask */
#define PORT_DIR_DIR9(value)                  (PORT_DIR_DIR9_Msk & (_UINT32_(value) << PORT_DIR_DIR9_Pos)) /* Assignment of value for DIR9 in the PORT_DIR register */
#define PORT_DIR_DIR10_Pos                    _UINT32_(10)                                         /* (PORT_DIR) Port Data Direction 10 Position */
#define PORT_DIR_DIR10_Msk                    (_UINT32_(0x1) << PORT_DIR_DIR10_Pos)                /* (PORT_DIR) Port Data Direction 10 Mask */
#define PORT_DIR_DIR10(value)                 (PORT_DIR_DIR10_Msk & (_UINT32_(value) << PORT_DIR_DIR10_Pos)) /* Assignment of value for DIR10 in the PORT_DIR register */
#define PORT_DIR_DIR11_Pos                    _UINT32_(11)                                         /* (PORT_DIR) Port Data Direction 11 Position */
#define PORT_DIR_DIR11_Msk                    (_UINT32_(0x1) << PORT_DIR_DIR11_Pos)                /* (PORT_DIR) Port Data Direction 11 Mask */
#define PORT_DIR_DIR11(value)                 (PORT_DIR_DIR11_Msk & (_UINT32_(value) << PORT_DIR_DIR11_Pos)) /* Assignment of value for DIR11 in the PORT_DIR register */
#define PORT_DIR_DIR12_Pos                    _UINT32_(12)                                         /* (PORT_DIR) Port Data Direction 12 Position */
#define PORT_DIR_DIR12_Msk                    (_UINT32_(0x1) << PORT_DIR_DIR12_Pos)                /* (PORT_DIR) Port Data Direction 12 Mask */
#define PORT_DIR_DIR12(value)                 (PORT_DIR_DIR12_Msk & (_UINT32_(value) << PORT_DIR_DIR12_Pos)) /* Assignment of value for DIR12 in the PORT_DIR register */
#define PORT_DIR_DIR13_Pos                    _UINT32_(13)                                         /* (PORT_DIR) Port Data Direction 13 Position */
#define PORT_DIR_DIR13_Msk                    (_UINT32_(0x1) << PORT_DIR_DIR13_Pos)                /* (PORT_DIR) Port Data Direction 13 Mask */
#define PORT_DIR_DIR13(value)                 (PORT_DIR_DIR13_Msk & (_UINT32_(value) << PORT_DIR_DIR13_Pos)) /* Assignment of value for DIR13 in the PORT_DIR register */
#define PORT_DIR_DIR14_Pos                    _UINT32_(14)                                         /* (PORT_DIR) Port Data Direction 14 Position */
#define PORT_DIR_DIR14_Msk                    (_UINT32_(0x1) << PORT_DIR_DIR14_Pos)                /* (PORT_DIR) Port Data Direction 14 Mask */
#define PORT_DIR_DIR14(value)                 (PORT_DIR_DIR14_Msk & (_UINT32_(value) << PORT_DIR_DIR14_Pos)) /* Assignment of value for DIR14 in the PORT_DIR register */
#define PORT_DIR_DIR15_Pos                    _UINT32_(15)                                         /* (PORT_DIR) Port Data Direction 15 Position */
#define PORT_DIR_DIR15_Msk                    (_UINT32_(0x1) << PORT_DIR_DIR15_Pos)                /* (PORT_DIR) Port Data Direction 15 Mask */
#define PORT_DIR_DIR15(value)                 (PORT_DIR_DIR15_Msk & (_UINT32_(value) << PORT_DIR_DIR15_Pos)) /* Assignment of value for DIR15 in the PORT_DIR register */
#define PORT_DIR_DIR16_Pos                    _UINT32_(16)                                         /* (PORT_DIR) Port Data Direction 16 Position */
#define PORT_DIR_DIR16_Msk                    (_UINT32_(0x1) << PORT_DIR_DIR16_Pos)                /* (PORT_DIR) Port Data Direction 16 Mask */
#define PORT_DIR_DIR16(value)                 (PORT_DIR_DIR16_Msk & (_UINT32_(value) << PORT_DIR_DIR16_Pos)) /* Assignment of value for DIR16 in the PORT_DIR register */
#define PORT_DIR_DIR17_Pos                    _UINT32_(17)                                         /* (PORT_DIR) Port Data Direction 17 Position */
#define PORT_DIR_DIR17_Msk                    (_UINT32_(0x1) << PORT_DIR_DIR17_Pos)                /* (PORT_DIR) Port Data Direction 17 Mask */
#define PORT_DIR_DIR17(value)                 (PORT_DIR_DIR17_Msk & (_UINT32_(value) << PORT_DIR_DIR17_Pos)) /* Assignment of value for DIR17 in the PORT_DIR register */
#define PORT_DIR_DIR18_Pos                    _UINT32_(18)                                         /* (PORT_DIR) Port Data Direction 18 Position */
#define PORT_DIR_DIR18_Msk                    (_UINT32_(0x1) << PORT_DIR_DIR18_Pos)                /* (PORT_DIR) Port Data Direction 18 Mask */
#define PORT_DIR_DIR18(value)                 (PORT_DIR_DIR18_Msk & (_UINT32_(value) << PORT_DIR_DIR18_Pos)) /* Assignment of value for DIR18 in the PORT_DIR register */
#define PORT_DIR_DIR19_Pos                    _UINT32_(19)                                         /* (PORT_DIR) Port Data Direction 19 Position */
#define PORT_DIR_DIR19_Msk                    (_UINT32_(0x1) << PORT_DIR_DIR19_Pos)                /* (PORT_DIR) Port Data Direction 19 Mask */
#define PORT_DIR_DIR19(value)                 (PORT_DIR_DIR19_Msk & (_UINT32_(value) << PORT_DIR_DIR19_Pos)) /* Assignment of value for DIR19 in the PORT_DIR register */
#define PORT_DIR_DIR20_Pos                    _UINT32_(20)                                         /* (PORT_DIR) Port Data Direction 20 Position */
#define PORT_DIR_DIR20_Msk                    (_UINT32_(0x1) << PORT_DIR_DIR20_Pos)                /* (PORT_DIR) Port Data Direction 20 Mask */
#define PORT_DIR_DIR20(value)                 (PORT_DIR_DIR20_Msk & (_UINT32_(value) << PORT_DIR_DIR20_Pos)) /* Assignment of value for DIR20 in the PORT_DIR register */
#define PORT_DIR_DIR21_Pos                    _UINT32_(21)                                         /* (PORT_DIR) Port Data Direction 21 Position */
#define PORT_DIR_DIR21_Msk                    (_UINT32_(0x1) << PORT_DIR_DIR21_Pos)                /* (PORT_DIR) Port Data Direction 21 Mask */
#define PORT_DIR_DIR21(value)                 (PORT_DIR_DIR21_Msk & (_UINT32_(value) << PORT_DIR_DIR21_Pos)) /* Assignment of value for DIR21 in the PORT_DIR register */
#define PORT_DIR_DIR22_Pos                    _UINT32_(22)                                         /* (PORT_DIR) Port Data Direction 22 Position */
#define PORT_DIR_DIR22_Msk                    (_UINT32_(0x1) << PORT_DIR_DIR22_Pos)                /* (PORT_DIR) Port Data Direction 22 Mask */
#define PORT_DIR_DIR22(value)                 (PORT_DIR_DIR22_Msk & (_UINT32_(value) << PORT_DIR_DIR22_Pos)) /* Assignment of value for DIR22 in the PORT_DIR register */
#define PORT_DIR_DIR23_Pos                    _UINT32_(23)                                         /* (PORT_DIR) Port Data Direction 23 Position */
#define PORT_DIR_DIR23_Msk                    (_UINT32_(0x1) << PORT_DIR_DIR23_Pos)                /* (PORT_DIR) Port Data Direction 23 Mask */
#define PORT_DIR_DIR23(value)                 (PORT_DIR_DIR23_Msk & (_UINT32_(value) << PORT_DIR_DIR23_Pos)) /* Assignment of value for DIR23 in the PORT_DIR register */
#define PORT_DIR_DIR24_Pos                    _UINT32_(24)                                         /* (PORT_DIR) Port Data Direction 24 Position */
#define PORT_DIR_DIR24_Msk                    (_UINT32_(0x1) << PORT_DIR_DIR24_Pos)                /* (PORT_DIR) Port Data Direction 24 Mask */
#define PORT_DIR_DIR24(value)                 (PORT_DIR_DIR24_Msk & (_UINT32_(value) << PORT_DIR_DIR24_Pos)) /* Assignment of value for DIR24 in the PORT_DIR register */
#define PORT_DIR_DIR25_Pos                    _UINT32_(25)                                         /* (PORT_DIR) Port Data Direction 25 Position */
#define PORT_DIR_DIR25_Msk                    (_UINT32_(0x1) << PORT_DIR_DIR25_Pos)                /* (PORT_DIR) Port Data Direction 25 Mask */
#define PORT_DIR_DIR25(value)                 (PORT_DIR_DIR25_Msk & (_UINT32_(value) << PORT_DIR_DIR25_Pos)) /* Assignment of value for DIR25 in the PORT_DIR register */
#define PORT_DIR_DIR26_Pos                    _UINT32_(26)                                         /* (PORT_DIR) Port Data Direction 26 Position */
#define PORT_DIR_DIR26_Msk                    (_UINT32_(0x1) << PORT_DIR_DIR26_Pos)                /* (PORT_DIR) Port Data Direction 26 Mask */
#define PORT_DIR_DIR26(value)                 (PORT_DIR_DIR26_Msk & (_UINT32_(value) << PORT_DIR_DIR26_Pos)) /* Assignment of value for DIR26 in the PORT_DIR register */
#define PORT_DIR_DIR27_Pos                    _UINT32_(27)                                         /* (PORT_DIR) Port Data Direction 27 Position */
#define PORT_DIR_DIR27_Msk                    (_UINT32_(0x1) << PORT_DIR_DIR27_Pos)                /* (PORT_DIR) Port Data Direction 27 Mask */
#define PORT_DIR_DIR27(value)                 (PORT_DIR_DIR27_Msk & (_UINT32_(value) << PORT_DIR_DIR27_Pos)) /* Assignment of value for DIR27 in the PORT_DIR register */
#define PORT_DIR_DIR28_Pos                    _UINT32_(28)                                         /* (PORT_DIR) Port Data Direction 28 Position */
#define PORT_DIR_DIR28_Msk                    (_UINT32_(0x1) << PORT_DIR_DIR28_Pos)                /* (PORT_DIR) Port Data Direction 28 Mask */
#define PORT_DIR_DIR28(value)                 (PORT_DIR_DIR28_Msk & (_UINT32_(value) << PORT_DIR_DIR28_Pos)) /* Assignment of value for DIR28 in the PORT_DIR register */
#define PORT_DIR_DIR29_Pos                    _UINT32_(29)                                         /* (PORT_DIR) Port Data Direction 29 Position */
#define PORT_DIR_DIR29_Msk                    (_UINT32_(0x1) << PORT_DIR_DIR29_Pos)                /* (PORT_DIR) Port Data Direction 29 Mask */
#define PORT_DIR_DIR29(value)                 (PORT_DIR_DIR29_Msk & (_UINT32_(value) << PORT_DIR_DIR29_Pos)) /* Assignment of value for DIR29 in the PORT_DIR register */
#define PORT_DIR_DIR30_Pos                    _UINT32_(30)                                         /* (PORT_DIR) Port Data Direction 30 Position */
#define PORT_DIR_DIR30_Msk                    (_UINT32_(0x1) << PORT_DIR_DIR30_Pos)                /* (PORT_DIR) Port Data Direction 30 Mask */
#define PORT_DIR_DIR30(value)                 (PORT_DIR_DIR30_Msk & (_UINT32_(value) << PORT_DIR_DIR30_Pos)) /* Assignment of value for DIR30 in the PORT_DIR register */
#define PORT_DIR_DIR31_Pos                    _UINT32_(31)                                         /* (PORT_DIR) Port Data Direction 31 Position */
#define PORT_DIR_DIR31_Msk                    (_UINT32_(0x1) << PORT_DIR_DIR31_Pos)                /* (PORT_DIR) Port Data Direction 31 Mask */
#define PORT_DIR_DIR31(value)                 (PORT_DIR_DIR31_Msk & (_UINT32_(value) << PORT_DIR_DIR31_Pos)) /* Assignment of value for DIR31 in the PORT_DIR register */
#define PORT_DIR_Msk                          _UINT32_(0xFFFFFFFF)                                 /* (PORT_DIR) Register Mask  */

