Microchip-MPLAB-Harmony/touch_apps/apps/qt8_selfcap_surface_xpro_board/pic32cm_pl10_cnano_water_tolerance/firmware/src/packs/PIC32CM6408PL10048_DFP/component/port.h
#define PORT_DIR_DIR_Pos                      _UINT32_(0)                                          /* (PORT_DIR Position) Port Data Direction 3x */
#define PORT_DIR_DIR_Msk                      (_UINT32_(0xFFFFFFFF) << PORT_DIR_DIR_Pos)           /* (PORT_DIR Mask) DIR */
#define PORT_DIR_DIR(value)                   (PORT_DIR_DIR_Msk & (_UINT32_(value) << PORT_DIR_DIR_Pos)) 

/* -------- PORT_DIRCLR : (PORT Offset: 0x04) (R/W 32) Data Direction Clear -------- */
#define PORT_DIRCLR_RESETVALUE                _UINT32_(0x00)                                       /*  (PORT_DIRCLR) Data Direction Clear  Reset Value */

#define PORT_DIRCLR_DIR0CLR_Pos               _UINT32_(0)                                          /* (PORT_DIRCLR) Port Data Direction 0 Clear Position */
#define PORT_DIRCLR_DIR0CLR_Msk               (_UINT32_(0x1) << PORT_DIRCLR_DIR0CLR_Pos)           /* (PORT_DIRCLR) Port Data Direction 0 Clear Mask */
#define PORT_DIRCLR_DIR0CLR(value)            (PORT_DIRCLR_DIR0CLR_Msk & (_UINT32_(value) << PORT_DIRCLR_DIR0CLR_Pos)) /* Assignment of value for DIR0CLR in the PORT_DIRCLR register */
#define PORT_DIRCLR_DIR1CLR_Pos               _UINT32_(1)                                          /* (PORT_DIRCLR) Port Data Direction 1 Clear Position */
#define PORT_DIRCLR_DIR1CLR_Msk               (_UINT32_(0x1) << PORT_DIRCLR_DIR1CLR_Pos)           /* (PORT_DIRCLR) Port Data Direction 1 Clear Mask */
#define PORT_DIRCLR_DIR1CLR(value)            (PORT_DIRCLR_DIR1CLR_Msk & (_UINT32_(value) << PORT_DIRCLR_DIR1CLR_Pos)) /* Assignment of value for DIR1CLR in the PORT_DIRCLR register */
#define PORT_DIRCLR_DIR2CLR_Pos               _UINT32_(2)                                          /* (PORT_DIRCLR) Port Data Direction 2 Clear Position */
#define PORT_DIRCLR_DIR2CLR_Msk               (_UINT32_(0x1) << PORT_DIRCLR_DIR2CLR_Pos)           /* (PORT_DIRCLR) Port Data Direction 2 Clear Mask */
#define PORT_DIRCLR_DIR2CLR(value)            (PORT_DIRCLR_DIR2CLR_Msk & (_UINT32_(value) << PORT_DIRCLR_DIR2CLR_Pos)) /* Assignment of value for DIR2CLR in the PORT_DIRCLR register */
#define PORT_DIRCLR_DIR3CLR_Pos               _UINT32_(3)                                          /* (PORT_DIRCLR) Port Data Direction 3 Clear Position */
#define PORT_DIRCLR_DIR3CLR_Msk               (_UINT32_(0x1) << PORT_DIRCLR_DIR3CLR_Pos)           /* (PORT_DIRCLR) Port Data Direction 3 Clear Mask */
#define PORT_DIRCLR_DIR3CLR(value)            (PORT_DIRCLR_DIR3CLR_Msk & (_UINT32_(value) << PORT_DIRCLR_DIR3CLR_Pos)) /* Assignment of value for DIR3CLR in the PORT_DIRCLR register */
#define PORT_DIRCLR_DIR4CLR_Pos               _UINT32_(4)                                          /* (PORT_DIRCLR) Port Data Direction 4 Clear Position */
#define PORT_DIRCLR_DIR4CLR_Msk               (_UINT32_(0x1) << PORT_DIRCLR_DIR4CLR_Pos)           /* (PORT_DIRCLR) Port Data Direction 4 Clear Mask */
#define PORT_DIRCLR_DIR4CLR(value)            (PORT_DIRCLR_DIR4CLR_Msk & (_UINT32_(value) << PORT_DIRCLR_DIR4CLR_Pos)) /* Assignment of value for DIR4CLR in the PORT_DIRCLR register */
#define PORT_DIRCLR_DIR5CLR_Pos               _UINT32_(5)                                          /* (PORT_DIRCLR) Port Data Direction 5 Clear Position */
#define PORT_DIRCLR_DIR5CLR_Msk               (_UINT32_(0x1) << PORT_DIRCLR_DIR5CLR_Pos)           /* (PORT_DIRCLR) Port Data Direction 5 Clear Mask */
#define PORT_DIRCLR_DIR5CLR(value)            (PORT_DIRCLR_DIR5CLR_Msk & (_UINT32_(value) << PORT_DIRCLR_DIR5CLR_Pos)) /* Assignment of value for DIR5CLR in the PORT_DIRCLR register */
#define PORT_DIRCLR_DIR6CLR_Pos               _UINT32_(6)                                          /* (PORT_DIRCLR) Port Data Direction 6 Clear Position */
#define PORT_DIRCLR_DIR6CLR_Msk               (_UINT32_(0x1) << PORT_DIRCLR_DIR6CLR_Pos)           /* (PORT_DIRCLR) Port Data Direction 6 Clear Mask */
#define PORT_DIRCLR_DIR6CLR(value)            (PORT_DIRCLR_DIR6CLR_Msk & (_UINT32_(value) << PORT_DIRCLR_DIR6CLR_Pos)) /* Assignment of value for DIR6CLR in the PORT_DIRCLR register */
#define PORT_DIRCLR_DIR7CLR_Pos               _UINT32_(7)                                          /* (PORT_DIRCLR) Port Data Direction 7 Clear Position */
#define PORT_DIRCLR_DIR7CLR_Msk               (_UINT32_(0x1) << PORT_DIRCLR_DIR7CLR_Pos)           /* (PORT_DIRCLR) Port Data Direction 7 Clear Mask */
#define PORT_DIRCLR_DIR7CLR(value)            (PORT_DIRCLR_DIR7CLR_Msk & (_UINT32_(value) << PORT_DIRCLR_DIR7CLR_Pos)) /* Assignment of value for DIR7CLR in the PORT_DIRCLR register */
#define PORT_DIRCLR_DIR8CLR_Pos               _UINT32_(8)                                          /* (PORT_DIRCLR) Port Data Direction 8 Clear Position */
#define PORT_DIRCLR_DIR8CLR_Msk               (_UINT32_(0x1) << PORT_DIRCLR_DIR8CLR_Pos)           /* (PORT_DIRCLR) Port Data Direction 8 Clear Mask */
#define PORT_DIRCLR_DIR8CLR(value)            (PORT_DIRCLR_DIR8CLR_Msk & (_UINT32_(value) << PORT_DIRCLR_DIR8CLR_Pos)) /* Assignment of value for DIR8CLR in the PORT_DIRCLR register */
#define PORT_DIRCLR_DIR9CLR_Pos               _UINT32_(9)                                          /* (PORT_DIRCLR) Port Data Direction 9 Clear Position */
#define PORT_DIRCLR_DIR9CLR_Msk               (_UINT32_(0x1) << PORT_DIRCLR_DIR9CLR_Pos)           /* (PORT_DIRCLR) Port Data Direction 9 Clear Mask */
#define PORT_DIRCLR_DIR9CLR(value)            (PORT_DIRCLR_DIR9CLR_Msk & (_UINT32_(value) << PORT_DIRCLR_DIR9CLR_Pos)) /* Assignment of value for DIR9CLR in the PORT_DIRCLR register */
#define PORT_DIRCLR_DIR10CLR_Pos              _UINT32_(10)                                         /* (PORT_DIRCLR) Port Data Direction 10 Clear Position */
#define PORT_DIRCLR_DIR10CLR_Msk              (_UINT32_(0x1) << PORT_DIRCLR_DIR10CLR_Pos)          /* (PORT_DIRCLR) Port Data Direction 10 Clear Mask */
#define PORT_DIRCLR_DIR10CLR(value)           (PORT_DIRCLR_DIR10CLR_Msk & (_UINT32_(value) << PORT_DIRCLR_DIR10CLR_Pos)) /* Assignment of value for DIR10CLR in the PORT_DIRCLR register */
#define PORT_DIRCLR_DIR11CLR_Pos              _UINT32_(11)                                         /* (PORT_DIRCLR) Port Data Direction 11 Clear Position */
#define PORT_DIRCLR_DIR11CLR_Msk              (_UINT32_(0x1) << PORT_DIRCLR_DIR11CLR_Pos)          /* (PORT_DIRCLR) Port Data Direction 11 Clear Mask */
#define PORT_DIRCLR_DIR11CLR(value)           (PORT_DIRCLR_DIR11CLR_Msk & (_UINT32_(value) << PORT_DIRCLR_DIR11CLR_Pos)) /* Assignment of value for DIR11CLR in the PORT_DIRCLR register */
#define PORT_DIRCLR_DIR12CLR_Pos              _UINT32_(12)                                         /* (PORT_DIRCLR) Port Data Direction 12 Clear Position */
#define PORT_DIRCLR_DIR12CLR_Msk              (_UINT32_(0x1) << PORT_DIRCLR_DIR12CLR_Pos)          /* (PORT_DIRCLR) Port Data Direction 12 Clear Mask */
#define PORT_DIRCLR_DIR12CLR(value)           (PORT_DIRCLR_DIR12CLR_Msk & (_UINT32_(value) << PORT_DIRCLR_DIR12CLR_Pos)) /* Assignment of value for DIR12CLR in the PORT_DIRCLR register */
#define PORT_DIRCLR_DIR13CLR_Pos              _UINT32_(13)                                         /* (PORT_DIRCLR) Port Data Direction 13 Clear Position */
#define PORT_DIRCLR_DIR13CLR_Msk              (_UINT32_(0x1) << PORT_DIRCLR_DIR13CLR_Pos)          /* (PORT_DIRCLR) Port Data Direction 13 Clear Mask */
#define PORT_DIRCLR_DIR13CLR(value)           (PORT_DIRCLR_DIR13CLR_Msk & (_UINT32_(value) << PORT_DIRCLR_DIR13CLR_Pos)) /* Assignment of value for DIR13CLR in the PORT_DIRCLR register */
#define PORT_DIRCLR_DIR14CLR_Pos              _UINT32_(14)                                         /* (PORT_DIRCLR) Port Data Direction 14 Clear Position */
#define PORT_DIRCLR_DIR14CLR_Msk              (_UINT32_(0x1) << PORT_DIRCLR_DIR14CLR_Pos)          /* (PORT_DIRCLR) Port Data Direction 14 Clear Mask */
#define PORT_DIRCLR_DIR14CLR(value)           (PORT_DIRCLR_DIR14CLR_Msk & (_UINT32_(value) << PORT_DIRCLR_DIR14CLR_Pos)) /* Assignment of value for DIR14CLR in the PORT_DIRCLR register */
#define PORT_DIRCLR_DIR15CLR_Pos              _UINT32_(15)                                         /* (PORT_DIRCLR) Port Data Direction 15 Clear Position */
#define PORT_DIRCLR_DIR15CLR_Msk              (_UINT32_(0x1) << PORT_DIRCLR_DIR15CLR_Pos)          /* (PORT_DIRCLR) Port Data Direction 15 Clear Mask */
#define PORT_DIRCLR_DIR15CLR(value)           (PORT_DIRCLR_DIR15CLR_Msk & (_UINT32_(value) << PORT_DIRCLR_DIR15CLR_Pos)) /* Assignment of value for DIR15CLR in the PORT_DIRCLR register */
#define PORT_DIRCLR_DIR16CLR_Pos              _UINT32_(16)                                         /* (PORT_DIRCLR) Port Data Direction 16 Clear Position */
#define PORT_DIRCLR_DIR16CLR_Msk              (_UINT32_(0x1) << PORT_DIRCLR_DIR16CLR_Pos)          /* (PORT_DIRCLR) Port Data Direction 16 Clear Mask */
#define PORT_DIRCLR_DIR16CLR(value)           (PORT_DIRCLR_DIR16CLR_Msk & (_UINT32_(value) << PORT_DIRCLR_DIR16CLR_Pos)) /* Assignment of value for DIR16CLR in the PORT_DIRCLR register */
#define PORT_DIRCLR_DIR17CLR_Pos              _UINT32_(17)                                         /* (PORT_DIRCLR) Port Data Direction 17 Clear Position */
#define PORT_DIRCLR_DIR17CLR_Msk              (_UINT32_(0x1) << PORT_DIRCLR_DIR17CLR_Pos)          /* (PORT_DIRCLR) Port Data Direction 17 Clear Mask */
#define PORT_DIRCLR_DIR17CLR(value)           (PORT_DIRCLR_DIR17CLR_Msk & (_UINT32_(value) << PORT_DIRCLR_DIR17CLR_Pos)) /* Assignment of value for DIR17CLR in the PORT_DIRCLR register */
#define PORT_DIRCLR_DIR18CLR_Pos              _UINT32_(18)                                         /* (PORT_DIRCLR) Port Data Direction 18 Clear Position */
#define PORT_DIRCLR_DIR18CLR_Msk              (_UINT32_(0x1) << PORT_DIRCLR_DIR18CLR_Pos)          /* (PORT_DIRCLR) Port Data Direction 18 Clear Mask */
#define PORT_DIRCLR_DIR18CLR(value)           (PORT_DIRCLR_DIR18CLR_Msk & (_UINT32_(value) << PORT_DIRCLR_DIR18CLR_Pos)) /* Assignment of value for DIR18CLR in the PORT_DIRCLR register */
#define PORT_DIRCLR_DIR19CLR_Pos              _UINT32_(19)                                         /* (PORT_DIRCLR) Port Data Direction 19 Clear Position */
#define PORT_DIRCLR_DIR19CLR_Msk              (_UINT32_(0x1) << PORT_DIRCLR_DIR19CLR_Pos)          /* (PORT_DIRCLR) Port Data Direction 19 Clear Mask */
#define PORT_DIRCLR_DIR19CLR(value)           (PORT_DIRCLR_DIR19CLR_Msk & (_UINT32_(value) << PORT_DIRCLR_DIR19CLR_Pos)) /* Assignment of value for DIR19CLR in the PORT_DIRCLR register */
#define PORT_DIRCLR_DIR20CLR_Pos              _UINT32_(20)                                         /* (PORT_DIRCLR) Port Data Direction 20 Clear Position */
#define PORT_DIRCLR_DIR20CLR_Msk              (_UINT32_(0x1) << PORT_DIRCLR_DIR20CLR_Pos)          /* (PORT_DIRCLR) Port Data Direction 20 Clear Mask */
#define PORT_DIRCLR_DIR20CLR(value)           (PORT_DIRCLR_DIR20CLR_Msk & (_UINT32_(value) << PORT_DIRCLR_DIR20CLR_Pos)) /* Assignment of value for DIR20CLR in the PORT_DIRCLR register */
#define PORT_DIRCLR_DIR21CLR_Pos              _UINT32_(21)                                         /* (PORT_DIRCLR) Port Data Direction 21 Clear Position */
#define PORT_DIRCLR_DIR21CLR_Msk              (_UINT32_(0x1) << PORT_DIRCLR_DIR21CLR_Pos)          /* (PORT_DIRCLR) Port Data Direction 21 Clear Mask */
#define PORT_DIRCLR_DIR21CLR(value)           (PORT_DIRCLR_DIR21CLR_Msk & (_UINT32_(value) << PORT_DIRCLR_DIR21CLR_Pos)) /* Assignment of value for DIR21CLR in the PORT_DIRCLR register */
#define PORT_DIRCLR_DIR22CLR_Pos              _UINT32_(22)                                         /* (PORT_DIRCLR) Port Data Direction 22 Clear Position */
#define PORT_DIRCLR_DIR22CLR_Msk              (_UINT32_(0x1) << PORT_DIRCLR_DIR22CLR_Pos)          /* (PORT_DIRCLR) Port Data Direction 22 Clear Mask */
#define PORT_DIRCLR_DIR22CLR(value)           (PORT_DIRCLR_DIR22CLR_Msk & (_UINT32_(value) << PORT_DIRCLR_DIR22CLR_Pos)) /* Assignment of value for DIR22CLR in the PORT_DIRCLR register */
#define PORT_DIRCLR_DIR23CLR_Pos              _UINT32_(23)                                         /* (PORT_DIRCLR) Port Data Direction 23 Clear Position */
#define PORT_DIRCLR_DIR23CLR_Msk              (_UINT32_(0x1) << PORT_DIRCLR_DIR23CLR_Pos)          /* (PORT_DIRCLR) Port Data Direction 23 Clear Mask */
#define PORT_DIRCLR_DIR23CLR(value)           (PORT_DIRCLR_DIR23CLR_Msk & (_UINT32_(value) << PORT_DIRCLR_DIR23CLR_Pos)) /* Assignment of value for DIR23CLR in the PORT_DIRCLR register */
#define PORT_DIRCLR_DIR24CLR_Pos              _UINT32_(24)                                         /* (PORT_DIRCLR) Port Data Direction 24 Clear Position */
#define PORT_DIRCLR_DIR24CLR_Msk              (_UINT32_(0x1) << PORT_DIRCLR_DIR24CLR_Pos)          /* (PORT_DIRCLR) Port Data Direction 24 Clear Mask */
#define PORT_DIRCLR_DIR24CLR(value)           (PORT_DIRCLR_DIR24CLR_Msk & (_UINT32_(value) << PORT_DIRCLR_DIR24CLR_Pos)) /* Assignment of value for DIR24CLR in the PORT_DIRCLR register */
#define PORT_DIRCLR_DIR25CLR_Pos              _UINT32_(25)                                         /* (PORT_DIRCLR) Port Data Direction 25 Clear Position */
#define PORT_DIRCLR_DIR25CLR_Msk              (_UINT32_(0x1) << PORT_DIRCLR_DIR25CLR_Pos)          /* (PORT_DIRCLR) Port Data Direction 25 Clear Mask */
#define PORT_DIRCLR_DIR25CLR(value)           (PORT_DIRCLR_DIR25CLR_Msk & (_UINT32_(value) << PORT_DIRCLR_DIR25CLR_Pos)) /* Assignment of value for DIR25CLR in the PORT_DIRCLR register */
#define PORT_DIRCLR_DIR26CLR_Pos              _UINT32_(26)                                         /* (PORT_DIRCLR) Port Data Direction 26 Clear Position */
#define PORT_DIRCLR_DIR26CLR_Msk              (_UINT32_(0x1) << PORT_DIRCLR_DIR26CLR_Pos)          /* (PORT_DIRCLR) Port Data Direction 26 Clear Mask */
#define PORT_DIRCLR_DIR26CLR(value)           (PORT_DIRCLR_DIR26CLR_Msk & (_UINT32_(value) << PORT_DIRCLR_DIR26CLR_Pos)) /* Assignment of value for DIR26CLR in the PORT_DIRCLR register */
#define PORT_DIRCLR_DIR27CLR_Pos              _UINT32_(27)                                         /* (PORT_DIRCLR) Port Data Direction 27 Clear Position */
#define PORT_DIRCLR_DIR27CLR_Msk              (_UINT32_(0x1) << PORT_DIRCLR_DIR27CLR_Pos)          /* (PORT_DIRCLR) Port Data Direction 27 Clear Mask */
#define PORT_DIRCLR_DIR27CLR(value)           (PORT_DIRCLR_DIR27CLR_Msk & (_UINT32_(value) << PORT_DIRCLR_DIR27CLR_Pos)) /* Assignment of value for DIR27CLR in the PORT_DIRCLR register */
#define PORT_DIRCLR_DIR28CLR_Pos              _UINT32_(28)                                         /* (PORT_DIRCLR) Port Data Direction 28 Clear Position */
#define PORT_DIRCLR_DIR28CLR_Msk              (_UINT32_(0x1) << PORT_DIRCLR_DIR28CLR_Pos)          /* (PORT_DIRCLR) Port Data Direction 28 Clear Mask */
#define PORT_DIRCLR_DIR28CLR(value)           (PORT_DIRCLR_DIR28CLR_Msk & (_UINT32_(value) << PORT_DIRCLR_DIR28CLR_Pos)) /* Assignment of value for DIR28CLR in the PORT_DIRCLR register */
#define PORT_DIRCLR_DIR29CLR_Pos              _UINT32_(29)                                         /* (PORT_DIRCLR) Port Data Direction 29 Clear Position */
#define PORT_DIRCLR_DIR29CLR_Msk              (_UINT32_(0x1) << PORT_DIRCLR_DIR29CLR_Pos)          /* (PORT_DIRCLR) Port Data Direction 29 Clear Mask */
#define PORT_DIRCLR_DIR29CLR(value)           (PORT_DIRCLR_DIR29CLR_Msk & (_UINT32_(value) << PORT_DIRCLR_DIR29CLR_Pos)) /* Assignment of value for DIR29CLR in the PORT_DIRCLR register */
#define PORT_DIRCLR_DIR30CLR_Pos              _UINT32_(30)                                         /* (PORT_DIRCLR) Port Data Direction 30 Clear Position */
#define PORT_DIRCLR_DIR30CLR_Msk              (_UINT32_(0x1) << PORT_DIRCLR_DIR30CLR_Pos)          /* (PORT_DIRCLR) Port Data Direction 30 Clear Mask */
#define PORT_DIRCLR_DIR30CLR(value)           (PORT_DIRCLR_DIR30CLR_Msk & (_UINT32_(value) << PORT_DIRCLR_DIR30CLR_Pos)) /* Assignment of value for DIR30CLR in the PORT_DIRCLR register */
#define PORT_DIRCLR_DIR31CLR_Pos              _UINT32_(31)                                         /* (PORT_DIRCLR) Port Data Direction 31 Clear Position */
#define PORT_DIRCLR_DIR31CLR_Msk              (_UINT32_(0x1) << PORT_DIRCLR_DIR31CLR_Pos)          /* (PORT_DIRCLR) Port Data Direction 31 Clear Mask */
#define PORT_DIRCLR_DIR31CLR(value)           (PORT_DIRCLR_DIR31CLR_Msk & (_UINT32_(value) << PORT_DIRCLR_DIR31CLR_Pos)) /* Assignment of value for DIR31CLR in the PORT_DIRCLR register */
#define PORT_DIRCLR_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (PORT_DIRCLR) Register Mask  */


/* -------- PORT_DIRSET : (PORT Offset: 0x08) (R/W 32) Data Direction Set -------- */
#define PORT_DIRSET_RESETVALUE                _UINT32_(0x00)                                       /*  (PORT_DIRSET) Data Direction Set  Reset Value */

