Microchip-MPLAB-Harmony/touch_apps/apps/qt8_selfcap_surface_xpro_board/pic32cm_pl10_cnano_water_tolerance/firmware/src/packs/PIC32CM6408PL10048_DFP/component/port.h
#define PORT_DIRSET_DIR0SET_Pos               _UINT32_(0)                                          /* (PORT_DIRSET) Port Data Direction 0 Set Position */
#define PORT_DIRSET_DIR0SET_Msk               (_UINT32_(0x1) << PORT_DIRSET_DIR0SET_Pos)           /* (PORT_DIRSET) Port Data Direction 0 Set Mask */
#define PORT_DIRSET_DIR0SET(value)            (PORT_DIRSET_DIR0SET_Msk & (_UINT32_(value) << PORT_DIRSET_DIR0SET_Pos)) /* Assignment of value for DIR0SET in the PORT_DIRSET register */
#define PORT_DIRSET_DIR1SET_Pos               _UINT32_(1)                                          /* (PORT_DIRSET) Port Data Direction 1 Set Position */
#define PORT_DIRSET_DIR1SET_Msk               (_UINT32_(0x1) << PORT_DIRSET_DIR1SET_Pos)           /* (PORT_DIRSET) Port Data Direction 1 Set Mask */
#define PORT_DIRSET_DIR1SET(value)            (PORT_DIRSET_DIR1SET_Msk & (_UINT32_(value) << PORT_DIRSET_DIR1SET_Pos)) /* Assignment of value for DIR1SET in the PORT_DIRSET register */
#define PORT_DIRSET_DIR2SET_Pos               _UINT32_(2)                                          /* (PORT_DIRSET) Port Data Direction 2 Set Position */
#define PORT_DIRSET_DIR2SET_Msk               (_UINT32_(0x1) << PORT_DIRSET_DIR2SET_Pos)           /* (PORT_DIRSET) Port Data Direction 2 Set Mask */
#define PORT_DIRSET_DIR2SET(value)            (PORT_DIRSET_DIR2SET_Msk & (_UINT32_(value) << PORT_DIRSET_DIR2SET_Pos)) /* Assignment of value for DIR2SET in the PORT_DIRSET register */
#define PORT_DIRSET_DIR3SET_Pos               _UINT32_(3)                                          /* (PORT_DIRSET) Port Data Direction 3 Set Position */
#define PORT_DIRSET_DIR3SET_Msk               (_UINT32_(0x1) << PORT_DIRSET_DIR3SET_Pos)           /* (PORT_DIRSET) Port Data Direction 3 Set Mask */
#define PORT_DIRSET_DIR3SET(value)            (PORT_DIRSET_DIR3SET_Msk & (_UINT32_(value) << PORT_DIRSET_DIR3SET_Pos)) /* Assignment of value for DIR3SET in the PORT_DIRSET register */
#define PORT_DIRSET_DIR4SET_Pos               _UINT32_(4)                                          /* (PORT_DIRSET) Port Data Direction 4 Set Position */
#define PORT_DIRSET_DIR4SET_Msk               (_UINT32_(0x1) << PORT_DIRSET_DIR4SET_Pos)           /* (PORT_DIRSET) Port Data Direction 4 Set Mask */
#define PORT_DIRSET_DIR4SET(value)            (PORT_DIRSET_DIR4SET_Msk & (_UINT32_(value) << PORT_DIRSET_DIR4SET_Pos)) /* Assignment of value for DIR4SET in the PORT_DIRSET register */
#define PORT_DIRSET_DIR5SET_Pos               _UINT32_(5)                                          /* (PORT_DIRSET) Port Data Direction 5 Set Position */
#define PORT_DIRSET_DIR5SET_Msk               (_UINT32_(0x1) << PORT_DIRSET_DIR5SET_Pos)           /* (PORT_DIRSET) Port Data Direction 5 Set Mask */
#define PORT_DIRSET_DIR5SET(value)            (PORT_DIRSET_DIR5SET_Msk & (_UINT32_(value) << PORT_DIRSET_DIR5SET_Pos)) /* Assignment of value for DIR5SET in the PORT_DIRSET register */
#define PORT_DIRSET_DIR6SET_Pos               _UINT32_(6)                                          /* (PORT_DIRSET) Port Data Direction 6 Set Position */
#define PORT_DIRSET_DIR6SET_Msk               (_UINT32_(0x1) << PORT_DIRSET_DIR6SET_Pos)           /* (PORT_DIRSET) Port Data Direction 6 Set Mask */
#define PORT_DIRSET_DIR6SET(value)            (PORT_DIRSET_DIR6SET_Msk & (_UINT32_(value) << PORT_DIRSET_DIR6SET_Pos)) /* Assignment of value for DIR6SET in the PORT_DIRSET register */
#define PORT_DIRSET_DIR7SET_Pos               _UINT32_(7)                                          /* (PORT_DIRSET) Port Data Direction 7 Set Position */
#define PORT_DIRSET_DIR7SET_Msk               (_UINT32_(0x1) << PORT_DIRSET_DIR7SET_Pos)           /* (PORT_DIRSET) Port Data Direction 7 Set Mask */
#define PORT_DIRSET_DIR7SET(value)            (PORT_DIRSET_DIR7SET_Msk & (_UINT32_(value) << PORT_DIRSET_DIR7SET_Pos)) /* Assignment of value for DIR7SET in the PORT_DIRSET register */
#define PORT_DIRSET_DIR8SET_Pos               _UINT32_(8)                                          /* (PORT_DIRSET) Port Data Direction 8 Set Position */
#define PORT_DIRSET_DIR8SET_Msk               (_UINT32_(0x1) << PORT_DIRSET_DIR8SET_Pos)           /* (PORT_DIRSET) Port Data Direction 8 Set Mask */
#define PORT_DIRSET_DIR8SET(value)            (PORT_DIRSET_DIR8SET_Msk & (_UINT32_(value) << PORT_DIRSET_DIR8SET_Pos)) /* Assignment of value for DIR8SET in the PORT_DIRSET register */
#define PORT_DIRSET_DIR9SET_Pos               _UINT32_(9)                                          /* (PORT_DIRSET) Port Data Direction 9 Set Position */
#define PORT_DIRSET_DIR9SET_Msk               (_UINT32_(0x1) << PORT_DIRSET_DIR9SET_Pos)           /* (PORT_DIRSET) Port Data Direction 9 Set Mask */
#define PORT_DIRSET_DIR9SET(value)            (PORT_DIRSET_DIR9SET_Msk & (_UINT32_(value) << PORT_DIRSET_DIR9SET_Pos)) /* Assignment of value for DIR9SET in the PORT_DIRSET register */
#define PORT_DIRSET_DIR10SET_Pos              _UINT32_(10)                                         /* (PORT_DIRSET) Port Data Direction 10 Set Position */
#define PORT_DIRSET_DIR10SET_Msk              (_UINT32_(0x1) << PORT_DIRSET_DIR10SET_Pos)          /* (PORT_DIRSET) Port Data Direction 10 Set Mask */
#define PORT_DIRSET_DIR10SET(value)           (PORT_DIRSET_DIR10SET_Msk & (_UINT32_(value) << PORT_DIRSET_DIR10SET_Pos)) /* Assignment of value for DIR10SET in the PORT_DIRSET register */
#define PORT_DIRSET_DIR11SET_Pos              _UINT32_(11)                                         /* (PORT_DIRSET) Port Data Direction 11 Set Position */
#define PORT_DIRSET_DIR11SET_Msk              (_UINT32_(0x1) << PORT_DIRSET_DIR11SET_Pos)          /* (PORT_DIRSET) Port Data Direction 11 Set Mask */
#define PORT_DIRSET_DIR11SET(value)           (PORT_DIRSET_DIR11SET_Msk & (_UINT32_(value) << PORT_DIRSET_DIR11SET_Pos)) /* Assignment of value for DIR11SET in the PORT_DIRSET register */
#define PORT_DIRSET_DIR12SET_Pos              _UINT32_(12)                                         /* (PORT_DIRSET) Port Data Direction 12 Set Position */
#define PORT_DIRSET_DIR12SET_Msk              (_UINT32_(0x1) << PORT_DIRSET_DIR12SET_Pos)          /* (PORT_DIRSET) Port Data Direction 12 Set Mask */
#define PORT_DIRSET_DIR12SET(value)           (PORT_DIRSET_DIR12SET_Msk & (_UINT32_(value) << PORT_DIRSET_DIR12SET_Pos)) /* Assignment of value for DIR12SET in the PORT_DIRSET register */
#define PORT_DIRSET_DIR13SET_Pos              _UINT32_(13)                                         /* (PORT_DIRSET) Port Data Direction 13 Set Position */
#define PORT_DIRSET_DIR13SET_Msk              (_UINT32_(0x1) << PORT_DIRSET_DIR13SET_Pos)          /* (PORT_DIRSET) Port Data Direction 13 Set Mask */
#define PORT_DIRSET_DIR13SET(value)           (PORT_DIRSET_DIR13SET_Msk & (_UINT32_(value) << PORT_DIRSET_DIR13SET_Pos)) /* Assignment of value for DIR13SET in the PORT_DIRSET register */
#define PORT_DIRSET_DIR14SET_Pos              _UINT32_(14)                                         /* (PORT_DIRSET) Port Data Direction 14 Set Position */
#define PORT_DIRSET_DIR14SET_Msk              (_UINT32_(0x1) << PORT_DIRSET_DIR14SET_Pos)          /* (PORT_DIRSET) Port Data Direction 14 Set Mask */
#define PORT_DIRSET_DIR14SET(value)           (PORT_DIRSET_DIR14SET_Msk & (_UINT32_(value) << PORT_DIRSET_DIR14SET_Pos)) /* Assignment of value for DIR14SET in the PORT_DIRSET register */
#define PORT_DIRSET_DIR15SET_Pos              _UINT32_(15)                                         /* (PORT_DIRSET) Port Data Direction 15 Set Position */
#define PORT_DIRSET_DIR15SET_Msk              (_UINT32_(0x1) << PORT_DIRSET_DIR15SET_Pos)          /* (PORT_DIRSET) Port Data Direction 15 Set Mask */
#define PORT_DIRSET_DIR15SET(value)           (PORT_DIRSET_DIR15SET_Msk & (_UINT32_(value) << PORT_DIRSET_DIR15SET_Pos)) /* Assignment of value for DIR15SET in the PORT_DIRSET register */
#define PORT_DIRSET_DIR16SET_Pos              _UINT32_(16)                                         /* (PORT_DIRSET) Port Data Direction 16 Set Position */
#define PORT_DIRSET_DIR16SET_Msk              (_UINT32_(0x1) << PORT_DIRSET_DIR16SET_Pos)          /* (PORT_DIRSET) Port Data Direction 16 Set Mask */
#define PORT_DIRSET_DIR16SET(value)           (PORT_DIRSET_DIR16SET_Msk & (_UINT32_(value) << PORT_DIRSET_DIR16SET_Pos)) /* Assignment of value for DIR16SET in the PORT_DIRSET register */
#define PORT_DIRSET_DIR17SET_Pos              _UINT32_(17)                                         /* (PORT_DIRSET) Port Data Direction 17 Set Position */
#define PORT_DIRSET_DIR17SET_Msk              (_UINT32_(0x1) << PORT_DIRSET_DIR17SET_Pos)          /* (PORT_DIRSET) Port Data Direction 17 Set Mask */
#define PORT_DIRSET_DIR17SET(value)           (PORT_DIRSET_DIR17SET_Msk & (_UINT32_(value) << PORT_DIRSET_DIR17SET_Pos)) /* Assignment of value for DIR17SET in the PORT_DIRSET register */
#define PORT_DIRSET_DIR18SET_Pos              _UINT32_(18)                                         /* (PORT_DIRSET) Port Data Direction 18 Set Position */
#define PORT_DIRSET_DIR18SET_Msk              (_UINT32_(0x1) << PORT_DIRSET_DIR18SET_Pos)          /* (PORT_DIRSET) Port Data Direction 18 Set Mask */
#define PORT_DIRSET_DIR18SET(value)           (PORT_DIRSET_DIR18SET_Msk & (_UINT32_(value) << PORT_DIRSET_DIR18SET_Pos)) /* Assignment of value for DIR18SET in the PORT_DIRSET register */
#define PORT_DIRSET_DIR19SET_Pos              _UINT32_(19)                                         /* (PORT_DIRSET) Port Data Direction 19 Set Position */
#define PORT_DIRSET_DIR19SET_Msk              (_UINT32_(0x1) << PORT_DIRSET_DIR19SET_Pos)          /* (PORT_DIRSET) Port Data Direction 19 Set Mask */
#define PORT_DIRSET_DIR19SET(value)           (PORT_DIRSET_DIR19SET_Msk & (_UINT32_(value) << PORT_DIRSET_DIR19SET_Pos)) /* Assignment of value for DIR19SET in the PORT_DIRSET register */
#define PORT_DIRSET_DIR20SET_Pos              _UINT32_(20)                                         /* (PORT_DIRSET) Port Data Direction 20 Set Position */
#define PORT_DIRSET_DIR20SET_Msk              (_UINT32_(0x1) << PORT_DIRSET_DIR20SET_Pos)          /* (PORT_DIRSET) Port Data Direction 20 Set Mask */
#define PORT_DIRSET_DIR20SET(value)           (PORT_DIRSET_DIR20SET_Msk & (_UINT32_(value) << PORT_DIRSET_DIR20SET_Pos)) /* Assignment of value for DIR20SET in the PORT_DIRSET register */
#define PORT_DIRSET_DIR21SET_Pos              _UINT32_(21)                                         /* (PORT_DIRSET) Port Data Direction 21 Set Position */
#define PORT_DIRSET_DIR21SET_Msk              (_UINT32_(0x1) << PORT_DIRSET_DIR21SET_Pos)          /* (PORT_DIRSET) Port Data Direction 21 Set Mask */
#define PORT_DIRSET_DIR21SET(value)           (PORT_DIRSET_DIR21SET_Msk & (_UINT32_(value) << PORT_DIRSET_DIR21SET_Pos)) /* Assignment of value for DIR21SET in the PORT_DIRSET register */
#define PORT_DIRSET_DIR22SET_Pos              _UINT32_(22)                                         /* (PORT_DIRSET) Port Data Direction 22 Set Position */
#define PORT_DIRSET_DIR22SET_Msk              (_UINT32_(0x1) << PORT_DIRSET_DIR22SET_Pos)          /* (PORT_DIRSET) Port Data Direction 22 Set Mask */
#define PORT_DIRSET_DIR22SET(value)           (PORT_DIRSET_DIR22SET_Msk & (_UINT32_(value) << PORT_DIRSET_DIR22SET_Pos)) /* Assignment of value for DIR22SET in the PORT_DIRSET register */
#define PORT_DIRSET_DIR23SET_Pos              _UINT32_(23)                                         /* (PORT_DIRSET) Port Data Direction 23 Set Position */
#define PORT_DIRSET_DIR23SET_Msk              (_UINT32_(0x1) << PORT_DIRSET_DIR23SET_Pos)          /* (PORT_DIRSET) Port Data Direction 23 Set Mask */
#define PORT_DIRSET_DIR23SET(value)           (PORT_DIRSET_DIR23SET_Msk & (_UINT32_(value) << PORT_DIRSET_DIR23SET_Pos)) /* Assignment of value for DIR23SET in the PORT_DIRSET register */
#define PORT_DIRSET_DIR24SET_Pos              _UINT32_(24)                                         /* (PORT_DIRSET) Port Data Direction 24 Set Position */
#define PORT_DIRSET_DIR24SET_Msk              (_UINT32_(0x1) << PORT_DIRSET_DIR24SET_Pos)          /* (PORT_DIRSET) Port Data Direction 24 Set Mask */
#define PORT_DIRSET_DIR24SET(value)           (PORT_DIRSET_DIR24SET_Msk & (_UINT32_(value) << PORT_DIRSET_DIR24SET_Pos)) /* Assignment of value for DIR24SET in the PORT_DIRSET register */
#define PORT_DIRSET_DIR25SET_Pos              _UINT32_(25)                                         /* (PORT_DIRSET) Port Data Direction 25 Set Position */
#define PORT_DIRSET_DIR25SET_Msk              (_UINT32_(0x1) << PORT_DIRSET_DIR25SET_Pos)          /* (PORT_DIRSET) Port Data Direction 25 Set Mask */
#define PORT_DIRSET_DIR25SET(value)           (PORT_DIRSET_DIR25SET_Msk & (_UINT32_(value) << PORT_DIRSET_DIR25SET_Pos)) /* Assignment of value for DIR25SET in the PORT_DIRSET register */
#define PORT_DIRSET_DIR26SET_Pos              _UINT32_(26)                                         /* (PORT_DIRSET) Port Data Direction 26 Set Position */
#define PORT_DIRSET_DIR26SET_Msk              (_UINT32_(0x1) << PORT_DIRSET_DIR26SET_Pos)          /* (PORT_DIRSET) Port Data Direction 26 Set Mask */
#define PORT_DIRSET_DIR26SET(value)           (PORT_DIRSET_DIR26SET_Msk & (_UINT32_(value) << PORT_DIRSET_DIR26SET_Pos)) /* Assignment of value for DIR26SET in the PORT_DIRSET register */
#define PORT_DIRSET_DIR27SET_Pos              _UINT32_(27)                                         /* (PORT_DIRSET) Port Data Direction 27 Set Position */
#define PORT_DIRSET_DIR27SET_Msk              (_UINT32_(0x1) << PORT_DIRSET_DIR27SET_Pos)          /* (PORT_DIRSET) Port Data Direction 27 Set Mask */
#define PORT_DIRSET_DIR27SET(value)           (PORT_DIRSET_DIR27SET_Msk & (_UINT32_(value) << PORT_DIRSET_DIR27SET_Pos)) /* Assignment of value for DIR27SET in the PORT_DIRSET register */
#define PORT_DIRSET_DIR28SET_Pos              _UINT32_(28)                                         /* (PORT_DIRSET) Port Data Direction 28 Set Position */
#define PORT_DIRSET_DIR28SET_Msk              (_UINT32_(0x1) << PORT_DIRSET_DIR28SET_Pos)          /* (PORT_DIRSET) Port Data Direction 28 Set Mask */
#define PORT_DIRSET_DIR28SET(value)           (PORT_DIRSET_DIR28SET_Msk & (_UINT32_(value) << PORT_DIRSET_DIR28SET_Pos)) /* Assignment of value for DIR28SET in the PORT_DIRSET register */
#define PORT_DIRSET_DIR29SET_Pos              _UINT32_(29)                                         /* (PORT_DIRSET) Port Data Direction 29 Set Position */
#define PORT_DIRSET_DIR29SET_Msk              (_UINT32_(0x1) << PORT_DIRSET_DIR29SET_Pos)          /* (PORT_DIRSET) Port Data Direction 29 Set Mask */
#define PORT_DIRSET_DIR29SET(value)           (PORT_DIRSET_DIR29SET_Msk & (_UINT32_(value) << PORT_DIRSET_DIR29SET_Pos)) /* Assignment of value for DIR29SET in the PORT_DIRSET register */
#define PORT_DIRSET_DIR30SET_Pos              _UINT32_(30)                                         /* (PORT_DIRSET) Port Data Direction 30 Set Position */
#define PORT_DIRSET_DIR30SET_Msk              (_UINT32_(0x1) << PORT_DIRSET_DIR30SET_Pos)          /* (PORT_DIRSET) Port Data Direction 30 Set Mask */
#define PORT_DIRSET_DIR30SET(value)           (PORT_DIRSET_DIR30SET_Msk & (_UINT32_(value) << PORT_DIRSET_DIR30SET_Pos)) /* Assignment of value for DIR30SET in the PORT_DIRSET register */
#define PORT_DIRSET_DIR31SET_Pos              _UINT32_(31)                                         /* (PORT_DIRSET) Port Data Direction 31 Set Position */
#define PORT_DIRSET_DIR31SET_Msk              (_UINT32_(0x1) << PORT_DIRSET_DIR31SET_Pos)          /* (PORT_DIRSET) Port Data Direction 31 Set Mask */
#define PORT_DIRSET_DIR31SET(value)           (PORT_DIRSET_DIR31SET_Msk & (_UINT32_(value) << PORT_DIRSET_DIR31SET_Pos)) /* Assignment of value for DIR31SET in the PORT_DIRSET register */
#define PORT_DIRSET_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (PORT_DIRSET) Register Mask  */


/* -------- PORT_DIRTGL : (PORT Offset: 0x0C) (R/W 32) Data Direction Toggle -------- */
#define PORT_DIRTGL_RESETVALUE                _UINT32_(0x00)                                       /*  (PORT_DIRTGL) Data Direction Toggle  Reset Value */

