Microchip-MPLAB-Harmony/touch_apps/apps/qt8_selfcap_surface_xpro_board/pic32cm_pl10_cnano_water_tolerance/firmware/src/packs/PIC32CM6408PL10048_DFP/component/port.h
#define PORT_DIRTGL_DIR0TGL_Pos               _UINT32_(0)                                          /* (PORT_DIRTGL) Port Data Direction 0 Toggle Position */
#define PORT_DIRTGL_DIR0TGL_Msk               (_UINT32_(0x1) << PORT_DIRTGL_DIR0TGL_Pos)           /* (PORT_DIRTGL) Port Data Direction 0 Toggle Mask */
#define PORT_DIRTGL_DIR0TGL(value)            (PORT_DIRTGL_DIR0TGL_Msk & (_UINT32_(value) << PORT_DIRTGL_DIR0TGL_Pos)) /* Assignment of value for DIR0TGL in the PORT_DIRTGL register */
#define PORT_DIRTGL_DIR1TGL_Pos               _UINT32_(1)                                          /* (PORT_DIRTGL) Port Data Direction 1 Toggle Position */
#define PORT_DIRTGL_DIR1TGL_Msk               (_UINT32_(0x1) << PORT_DIRTGL_DIR1TGL_Pos)           /* (PORT_DIRTGL) Port Data Direction 1 Toggle Mask */
#define PORT_DIRTGL_DIR1TGL(value)            (PORT_DIRTGL_DIR1TGL_Msk & (_UINT32_(value) << PORT_DIRTGL_DIR1TGL_Pos)) /* Assignment of value for DIR1TGL in the PORT_DIRTGL register */
#define PORT_DIRTGL_DIR2TGL_Pos               _UINT32_(2)                                          /* (PORT_DIRTGL) Port Data Direction 2 Toggle Position */
#define PORT_DIRTGL_DIR2TGL_Msk               (_UINT32_(0x1) << PORT_DIRTGL_DIR2TGL_Pos)           /* (PORT_DIRTGL) Port Data Direction 2 Toggle Mask */
#define PORT_DIRTGL_DIR2TGL(value)            (PORT_DIRTGL_DIR2TGL_Msk & (_UINT32_(value) << PORT_DIRTGL_DIR2TGL_Pos)) /* Assignment of value for DIR2TGL in the PORT_DIRTGL register */
#define PORT_DIRTGL_DIR3TGL_Pos               _UINT32_(3)                                          /* (PORT_DIRTGL) Port Data Direction 3 Toggle Position */
#define PORT_DIRTGL_DIR3TGL_Msk               (_UINT32_(0x1) << PORT_DIRTGL_DIR3TGL_Pos)           /* (PORT_DIRTGL) Port Data Direction 3 Toggle Mask */
#define PORT_DIRTGL_DIR3TGL(value)            (PORT_DIRTGL_DIR3TGL_Msk & (_UINT32_(value) << PORT_DIRTGL_DIR3TGL_Pos)) /* Assignment of value for DIR3TGL in the PORT_DIRTGL register */
#define PORT_DIRTGL_DIR4TGL_Pos               _UINT32_(4)                                          /* (PORT_DIRTGL) Port Data Direction 4 Toggle Position */
#define PORT_DIRTGL_DIR4TGL_Msk               (_UINT32_(0x1) << PORT_DIRTGL_DIR4TGL_Pos)           /* (PORT_DIRTGL) Port Data Direction 4 Toggle Mask */
#define PORT_DIRTGL_DIR4TGL(value)            (PORT_DIRTGL_DIR4TGL_Msk & (_UINT32_(value) << PORT_DIRTGL_DIR4TGL_Pos)) /* Assignment of value for DIR4TGL in the PORT_DIRTGL register */
#define PORT_DIRTGL_DIR5TGL_Pos               _UINT32_(5)                                          /* (PORT_DIRTGL) Port Data Direction 5 Toggle Position */
#define PORT_DIRTGL_DIR5TGL_Msk               (_UINT32_(0x1) << PORT_DIRTGL_DIR5TGL_Pos)           /* (PORT_DIRTGL) Port Data Direction 5 Toggle Mask */
#define PORT_DIRTGL_DIR5TGL(value)            (PORT_DIRTGL_DIR5TGL_Msk & (_UINT32_(value) << PORT_DIRTGL_DIR5TGL_Pos)) /* Assignment of value for DIR5TGL in the PORT_DIRTGL register */
#define PORT_DIRTGL_DIR6TGL_Pos               _UINT32_(6)                                          /* (PORT_DIRTGL) Port Data Direction 6 Toggle Position */
#define PORT_DIRTGL_DIR6TGL_Msk               (_UINT32_(0x1) << PORT_DIRTGL_DIR6TGL_Pos)           /* (PORT_DIRTGL) Port Data Direction 6 Toggle Mask */
#define PORT_DIRTGL_DIR6TGL(value)            (PORT_DIRTGL_DIR6TGL_Msk & (_UINT32_(value) << PORT_DIRTGL_DIR6TGL_Pos)) /* Assignment of value for DIR6TGL in the PORT_DIRTGL register */
#define PORT_DIRTGL_DIR7TGL_Pos               _UINT32_(7)                                          /* (PORT_DIRTGL) Port Data Direction 7 Toggle Position */
#define PORT_DIRTGL_DIR7TGL_Msk               (_UINT32_(0x1) << PORT_DIRTGL_DIR7TGL_Pos)           /* (PORT_DIRTGL) Port Data Direction 7 Toggle Mask */
#define PORT_DIRTGL_DIR7TGL(value)            (PORT_DIRTGL_DIR7TGL_Msk & (_UINT32_(value) << PORT_DIRTGL_DIR7TGL_Pos)) /* Assignment of value for DIR7TGL in the PORT_DIRTGL register */
#define PORT_DIRTGL_DIR8TGL_Pos               _UINT32_(8)                                          /* (PORT_DIRTGL) Port Data Direction 8 Toggle Position */
#define PORT_DIRTGL_DIR8TGL_Msk               (_UINT32_(0x1) << PORT_DIRTGL_DIR8TGL_Pos)           /* (PORT_DIRTGL) Port Data Direction 8 Toggle Mask */
#define PORT_DIRTGL_DIR8TGL(value)            (PORT_DIRTGL_DIR8TGL_Msk & (_UINT32_(value) << PORT_DIRTGL_DIR8TGL_Pos)) /* Assignment of value for DIR8TGL in the PORT_DIRTGL register */
#define PORT_DIRTGL_DIR9TGL_Pos               _UINT32_(9)                                          /* (PORT_DIRTGL) Port Data Direction 9 Toggle Position */
#define PORT_DIRTGL_DIR9TGL_Msk               (_UINT32_(0x1) << PORT_DIRTGL_DIR9TGL_Pos)           /* (PORT_DIRTGL) Port Data Direction 9 Toggle Mask */
#define PORT_DIRTGL_DIR9TGL(value)            (PORT_DIRTGL_DIR9TGL_Msk & (_UINT32_(value) << PORT_DIRTGL_DIR9TGL_Pos)) /* Assignment of value for DIR9TGL in the PORT_DIRTGL register */
#define PORT_DIRTGL_DIR10TGL_Pos              _UINT32_(10)                                         /* (PORT_DIRTGL) Port Data Direction 10 Toggle Position */
#define PORT_DIRTGL_DIR10TGL_Msk              (_UINT32_(0x1) << PORT_DIRTGL_DIR10TGL_Pos)          /* (PORT_DIRTGL) Port Data Direction 10 Toggle Mask */
#define PORT_DIRTGL_DIR10TGL(value)           (PORT_DIRTGL_DIR10TGL_Msk & (_UINT32_(value) << PORT_DIRTGL_DIR10TGL_Pos)) /* Assignment of value for DIR10TGL in the PORT_DIRTGL register */
#define PORT_DIRTGL_DIR11TGL_Pos              _UINT32_(11)                                         /* (PORT_DIRTGL) Port Data Direction 11 Toggle Position */
#define PORT_DIRTGL_DIR11TGL_Msk              (_UINT32_(0x1) << PORT_DIRTGL_DIR11TGL_Pos)          /* (PORT_DIRTGL) Port Data Direction 11 Toggle Mask */
#define PORT_DIRTGL_DIR11TGL(value)           (PORT_DIRTGL_DIR11TGL_Msk & (_UINT32_(value) << PORT_DIRTGL_DIR11TGL_Pos)) /* Assignment of value for DIR11TGL in the PORT_DIRTGL register */
#define PORT_DIRTGL_DIR12TGL_Pos              _UINT32_(12)                                         /* (PORT_DIRTGL) Port Data Direction 12 Toggle Position */
#define PORT_DIRTGL_DIR12TGL_Msk              (_UINT32_(0x1) << PORT_DIRTGL_DIR12TGL_Pos)          /* (PORT_DIRTGL) Port Data Direction 12 Toggle Mask */
#define PORT_DIRTGL_DIR12TGL(value)           (PORT_DIRTGL_DIR12TGL_Msk & (_UINT32_(value) << PORT_DIRTGL_DIR12TGL_Pos)) /* Assignment of value for DIR12TGL in the PORT_DIRTGL register */
#define PORT_DIRTGL_DIR13TGL_Pos              _UINT32_(13)                                         /* (PORT_DIRTGL) Port Data Direction 13 Toggle Position */
#define PORT_DIRTGL_DIR13TGL_Msk              (_UINT32_(0x1) << PORT_DIRTGL_DIR13TGL_Pos)          /* (PORT_DIRTGL) Port Data Direction 13 Toggle Mask */
#define PORT_DIRTGL_DIR13TGL(value)           (PORT_DIRTGL_DIR13TGL_Msk & (_UINT32_(value) << PORT_DIRTGL_DIR13TGL_Pos)) /* Assignment of value for DIR13TGL in the PORT_DIRTGL register */
#define PORT_DIRTGL_DIR14TGL_Pos              _UINT32_(14)                                         /* (PORT_DIRTGL) Port Data Direction 14 Toggle Position */
#define PORT_DIRTGL_DIR14TGL_Msk              (_UINT32_(0x1) << PORT_DIRTGL_DIR14TGL_Pos)          /* (PORT_DIRTGL) Port Data Direction 14 Toggle Mask */
#define PORT_DIRTGL_DIR14TGL(value)           (PORT_DIRTGL_DIR14TGL_Msk & (_UINT32_(value) << PORT_DIRTGL_DIR14TGL_Pos)) /* Assignment of value for DIR14TGL in the PORT_DIRTGL register */
#define PORT_DIRTGL_DIR15TGL_Pos              _UINT32_(15)                                         /* (PORT_DIRTGL) Port Data Direction 15 Toggle Position */
#define PORT_DIRTGL_DIR15TGL_Msk              (_UINT32_(0x1) << PORT_DIRTGL_DIR15TGL_Pos)          /* (PORT_DIRTGL) Port Data Direction 15 Toggle Mask */
#define PORT_DIRTGL_DIR15TGL(value)           (PORT_DIRTGL_DIR15TGL_Msk & (_UINT32_(value) << PORT_DIRTGL_DIR15TGL_Pos)) /* Assignment of value for DIR15TGL in the PORT_DIRTGL register */
#define PORT_DIRTGL_DIR16TGL_Pos              _UINT32_(16)                                         /* (PORT_DIRTGL) Port Data Direction 16 Toggle Position */
#define PORT_DIRTGL_DIR16TGL_Msk              (_UINT32_(0x1) << PORT_DIRTGL_DIR16TGL_Pos)          /* (PORT_DIRTGL) Port Data Direction 16 Toggle Mask */
#define PORT_DIRTGL_DIR16TGL(value)           (PORT_DIRTGL_DIR16TGL_Msk & (_UINT32_(value) << PORT_DIRTGL_DIR16TGL_Pos)) /* Assignment of value for DIR16TGL in the PORT_DIRTGL register */
#define PORT_DIRTGL_DIR17TGL_Pos              _UINT32_(17)                                         /* (PORT_DIRTGL) Port Data Direction 17 Toggle Position */
#define PORT_DIRTGL_DIR17TGL_Msk              (_UINT32_(0x1) << PORT_DIRTGL_DIR17TGL_Pos)          /* (PORT_DIRTGL) Port Data Direction 17 Toggle Mask */
#define PORT_DIRTGL_DIR17TGL(value)           (PORT_DIRTGL_DIR17TGL_Msk & (_UINT32_(value) << PORT_DIRTGL_DIR17TGL_Pos)) /* Assignment of value for DIR17TGL in the PORT_DIRTGL register */
#define PORT_DIRTGL_DIR18TGL_Pos              _UINT32_(18)                                         /* (PORT_DIRTGL) Port Data Direction 18 Toggle Position */
#define PORT_DIRTGL_DIR18TGL_Msk              (_UINT32_(0x1) << PORT_DIRTGL_DIR18TGL_Pos)          /* (PORT_DIRTGL) Port Data Direction 18 Toggle Mask */
#define PORT_DIRTGL_DIR18TGL(value)           (PORT_DIRTGL_DIR18TGL_Msk & (_UINT32_(value) << PORT_DIRTGL_DIR18TGL_Pos)) /* Assignment of value for DIR18TGL in the PORT_DIRTGL register */
#define PORT_DIRTGL_DIR19TGL_Pos              _UINT32_(19)                                         /* (PORT_DIRTGL) Port Data Direction 19 Toggle Position */
#define PORT_DIRTGL_DIR19TGL_Msk              (_UINT32_(0x1) << PORT_DIRTGL_DIR19TGL_Pos)          /* (PORT_DIRTGL) Port Data Direction 19 Toggle Mask */
#define PORT_DIRTGL_DIR19TGL(value)           (PORT_DIRTGL_DIR19TGL_Msk & (_UINT32_(value) << PORT_DIRTGL_DIR19TGL_Pos)) /* Assignment of value for DIR19TGL in the PORT_DIRTGL register */
#define PORT_DIRTGL_DIR20TGL_Pos              _UINT32_(20)                                         /* (PORT_DIRTGL) Port Data Direction 20 Toggle Position */
#define PORT_DIRTGL_DIR20TGL_Msk              (_UINT32_(0x1) << PORT_DIRTGL_DIR20TGL_Pos)          /* (PORT_DIRTGL) Port Data Direction 20 Toggle Mask */
#define PORT_DIRTGL_DIR20TGL(value)           (PORT_DIRTGL_DIR20TGL_Msk & (_UINT32_(value) << PORT_DIRTGL_DIR20TGL_Pos)) /* Assignment of value for DIR20TGL in the PORT_DIRTGL register */
#define PORT_DIRTGL_DIR21TGL_Pos              _UINT32_(21)                                         /* (PORT_DIRTGL) Port Data Direction 21 Toggle Position */
#define PORT_DIRTGL_DIR21TGL_Msk              (_UINT32_(0x1) << PORT_DIRTGL_DIR21TGL_Pos)          /* (PORT_DIRTGL) Port Data Direction 21 Toggle Mask */
#define PORT_DIRTGL_DIR21TGL(value)           (PORT_DIRTGL_DIR21TGL_Msk & (_UINT32_(value) << PORT_DIRTGL_DIR21TGL_Pos)) /* Assignment of value for DIR21TGL in the PORT_DIRTGL register */
#define PORT_DIRTGL_DIR22TGL_Pos              _UINT32_(22)                                         /* (PORT_DIRTGL) Port Data Direction 22 Toggle Position */
#define PORT_DIRTGL_DIR22TGL_Msk              (_UINT32_(0x1) << PORT_DIRTGL_DIR22TGL_Pos)          /* (PORT_DIRTGL) Port Data Direction 22 Toggle Mask */
#define PORT_DIRTGL_DIR22TGL(value)           (PORT_DIRTGL_DIR22TGL_Msk & (_UINT32_(value) << PORT_DIRTGL_DIR22TGL_Pos)) /* Assignment of value for DIR22TGL in the PORT_DIRTGL register */
#define PORT_DIRTGL_DIR23TGL_Pos              _UINT32_(23)                                         /* (PORT_DIRTGL) Port Data Direction 23 Toggle Position */
#define PORT_DIRTGL_DIR23TGL_Msk              (_UINT32_(0x1) << PORT_DIRTGL_DIR23TGL_Pos)          /* (PORT_DIRTGL) Port Data Direction 23 Toggle Mask */
#define PORT_DIRTGL_DIR23TGL(value)           (PORT_DIRTGL_DIR23TGL_Msk & (_UINT32_(value) << PORT_DIRTGL_DIR23TGL_Pos)) /* Assignment of value for DIR23TGL in the PORT_DIRTGL register */
#define PORT_DIRTGL_DIR24TGL_Pos              _UINT32_(24)                                         /* (PORT_DIRTGL) Port Data Direction 24 Toggle Position */
#define PORT_DIRTGL_DIR24TGL_Msk              (_UINT32_(0x1) << PORT_DIRTGL_DIR24TGL_Pos)          /* (PORT_DIRTGL) Port Data Direction 24 Toggle Mask */
#define PORT_DIRTGL_DIR24TGL(value)           (PORT_DIRTGL_DIR24TGL_Msk & (_UINT32_(value) << PORT_DIRTGL_DIR24TGL_Pos)) /* Assignment of value for DIR24TGL in the PORT_DIRTGL register */
#define PORT_DIRTGL_DIR25TGL_Pos              _UINT32_(25)                                         /* (PORT_DIRTGL) Port Data Direction 25 Toggle Position */
#define PORT_DIRTGL_DIR25TGL_Msk              (_UINT32_(0x1) << PORT_DIRTGL_DIR25TGL_Pos)          /* (PORT_DIRTGL) Port Data Direction 25 Toggle Mask */
#define PORT_DIRTGL_DIR25TGL(value)           (PORT_DIRTGL_DIR25TGL_Msk & (_UINT32_(value) << PORT_DIRTGL_DIR25TGL_Pos)) /* Assignment of value for DIR25TGL in the PORT_DIRTGL register */
#define PORT_DIRTGL_DIR26TGL_Pos              _UINT32_(26)                                         /* (PORT_DIRTGL) Port Data Direction 26 Toggle Position */
#define PORT_DIRTGL_DIR26TGL_Msk              (_UINT32_(0x1) << PORT_DIRTGL_DIR26TGL_Pos)          /* (PORT_DIRTGL) Port Data Direction 26 Toggle Mask */
#define PORT_DIRTGL_DIR26TGL(value)           (PORT_DIRTGL_DIR26TGL_Msk & (_UINT32_(value) << PORT_DIRTGL_DIR26TGL_Pos)) /* Assignment of value for DIR26TGL in the PORT_DIRTGL register */
#define PORT_DIRTGL_DIR27TGL_Pos              _UINT32_(27)                                         /* (PORT_DIRTGL) Port Data Direction 27 Toggle Position */
#define PORT_DIRTGL_DIR27TGL_Msk              (_UINT32_(0x1) << PORT_DIRTGL_DIR27TGL_Pos)          /* (PORT_DIRTGL) Port Data Direction 27 Toggle Mask */
#define PORT_DIRTGL_DIR27TGL(value)           (PORT_DIRTGL_DIR27TGL_Msk & (_UINT32_(value) << PORT_DIRTGL_DIR27TGL_Pos)) /* Assignment of value for DIR27TGL in the PORT_DIRTGL register */
#define PORT_DIRTGL_DIR28TGL_Pos              _UINT32_(28)                                         /* (PORT_DIRTGL) Port Data Direction 28 Toggle Position */
#define PORT_DIRTGL_DIR28TGL_Msk              (_UINT32_(0x1) << PORT_DIRTGL_DIR28TGL_Pos)          /* (PORT_DIRTGL) Port Data Direction 28 Toggle Mask */
#define PORT_DIRTGL_DIR28TGL(value)           (PORT_DIRTGL_DIR28TGL_Msk & (_UINT32_(value) << PORT_DIRTGL_DIR28TGL_Pos)) /* Assignment of value for DIR28TGL in the PORT_DIRTGL register */
#define PORT_DIRTGL_DIR29TGL_Pos              _UINT32_(29)                                         /* (PORT_DIRTGL) Port Data Direction 29 Toggle Position */
#define PORT_DIRTGL_DIR29TGL_Msk              (_UINT32_(0x1) << PORT_DIRTGL_DIR29TGL_Pos)          /* (PORT_DIRTGL) Port Data Direction 29 Toggle Mask */
#define PORT_DIRTGL_DIR29TGL(value)           (PORT_DIRTGL_DIR29TGL_Msk & (_UINT32_(value) << PORT_DIRTGL_DIR29TGL_Pos)) /* Assignment of value for DIR29TGL in the PORT_DIRTGL register */
#define PORT_DIRTGL_DIR30TGL_Pos              _UINT32_(30)                                         /* (PORT_DIRTGL) Port Data Direction 30 Toggle Position */
#define PORT_DIRTGL_DIR30TGL_Msk              (_UINT32_(0x1) << PORT_DIRTGL_DIR30TGL_Pos)          /* (PORT_DIRTGL) Port Data Direction 30 Toggle Mask */
#define PORT_DIRTGL_DIR30TGL(value)           (PORT_DIRTGL_DIR30TGL_Msk & (_UINT32_(value) << PORT_DIRTGL_DIR30TGL_Pos)) /* Assignment of value for DIR30TGL in the PORT_DIRTGL register */
#define PORT_DIRTGL_DIR31TGL_Pos              _UINT32_(31)                                         /* (PORT_DIRTGL) Port Data Direction 31 Toggle Position */
#define PORT_DIRTGL_DIR31TGL_Msk              (_UINT32_(0x1) << PORT_DIRTGL_DIR31TGL_Pos)          /* (PORT_DIRTGL) Port Data Direction 31 Toggle Mask */
#define PORT_DIRTGL_DIR31TGL(value)           (PORT_DIRTGL_DIR31TGL_Msk & (_UINT32_(value) << PORT_DIRTGL_DIR31TGL_Pos)) /* Assignment of value for DIR31TGL in the PORT_DIRTGL register */
#define PORT_DIRTGL_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (PORT_DIRTGL) Register Mask  */


/* -------- PORT_OUT : (PORT Offset: 0x10) (R/W 32) Data Output Value -------- */
#define PORT_OUT_RESETVALUE                   _UINT32_(0x00)                                       /*  (PORT_OUT) Data Output Value  Reset Value */

