Microchip-MPLAB-Harmony/touch_apps/apps/qt8_selfcap_surface_xpro_board/pic32cm_pl10_cnano_water_tolerance/firmware/src/packs/PIC32CM6408PL10048_DFP/component/port.h
#define PORT_OUT_OUT0_Pos                     _UINT32_(0)                                          /* (PORT_OUT) PORT Data Output Value 0 Position */
#define PORT_OUT_OUT0_Msk                     (_UINT32_(0x1) << PORT_OUT_OUT0_Pos)                 /* (PORT_OUT) PORT Data Output Value 0 Mask */
#define PORT_OUT_OUT0(value)                  (PORT_OUT_OUT0_Msk & (_UINT32_(value) << PORT_OUT_OUT0_Pos)) /* Assignment of value for OUT0 in the PORT_OUT register */
#define PORT_OUT_OUT1_Pos                     _UINT32_(1)                                          /* (PORT_OUT) PORT Data Output Value 1 Position */
#define PORT_OUT_OUT1_Msk                     (_UINT32_(0x1) << PORT_OUT_OUT1_Pos)                 /* (PORT_OUT) PORT Data Output Value 1 Mask */
#define PORT_OUT_OUT1(value)                  (PORT_OUT_OUT1_Msk & (_UINT32_(value) << PORT_OUT_OUT1_Pos)) /* Assignment of value for OUT1 in the PORT_OUT register */
#define PORT_OUT_OUT2_Pos                     _UINT32_(2)                                          /* (PORT_OUT) PORT Data Output Value 2 Position */
#define PORT_OUT_OUT2_Msk                     (_UINT32_(0x1) << PORT_OUT_OUT2_Pos)                 /* (PORT_OUT) PORT Data Output Value 2 Mask */
#define PORT_OUT_OUT2(value)                  (PORT_OUT_OUT2_Msk & (_UINT32_(value) << PORT_OUT_OUT2_Pos)) /* Assignment of value for OUT2 in the PORT_OUT register */
#define PORT_OUT_OUT3_Pos                     _UINT32_(3)                                          /* (PORT_OUT) PORT Data Output Value 3 Position */
#define PORT_OUT_OUT3_Msk                     (_UINT32_(0x1) << PORT_OUT_OUT3_Pos)                 /* (PORT_OUT) PORT Data Output Value 3 Mask */
#define PORT_OUT_OUT3(value)                  (PORT_OUT_OUT3_Msk & (_UINT32_(value) << PORT_OUT_OUT3_Pos)) /* Assignment of value for OUT3 in the PORT_OUT register */
#define PORT_OUT_OUT4_Pos                     _UINT32_(4)                                          /* (PORT_OUT) PORT Data Output Value 4 Position */
#define PORT_OUT_OUT4_Msk                     (_UINT32_(0x1) << PORT_OUT_OUT4_Pos)                 /* (PORT_OUT) PORT Data Output Value 4 Mask */
#define PORT_OUT_OUT4(value)                  (PORT_OUT_OUT4_Msk & (_UINT32_(value) << PORT_OUT_OUT4_Pos)) /* Assignment of value for OUT4 in the PORT_OUT register */
#define PORT_OUT_OUT5_Pos                     _UINT32_(5)                                          /* (PORT_OUT) PORT Data Output Value 5 Position */
#define PORT_OUT_OUT5_Msk                     (_UINT32_(0x1) << PORT_OUT_OUT5_Pos)                 /* (PORT_OUT) PORT Data Output Value 5 Mask */
#define PORT_OUT_OUT5(value)                  (PORT_OUT_OUT5_Msk & (_UINT32_(value) << PORT_OUT_OUT5_Pos)) /* Assignment of value for OUT5 in the PORT_OUT register */
#define PORT_OUT_OUT6_Pos                     _UINT32_(6)                                          /* (PORT_OUT) PORT Data Output Value 6 Position */
#define PORT_OUT_OUT6_Msk                     (_UINT32_(0x1) << PORT_OUT_OUT6_Pos)                 /* (PORT_OUT) PORT Data Output Value 6 Mask */
#define PORT_OUT_OUT6(value)                  (PORT_OUT_OUT6_Msk & (_UINT32_(value) << PORT_OUT_OUT6_Pos)) /* Assignment of value for OUT6 in the PORT_OUT register */
#define PORT_OUT_OUT7_Pos                     _UINT32_(7)                                          /* (PORT_OUT) PORT Data Output Value 7 Position */
#define PORT_OUT_OUT7_Msk                     (_UINT32_(0x1) << PORT_OUT_OUT7_Pos)                 /* (PORT_OUT) PORT Data Output Value 7 Mask */
#define PORT_OUT_OUT7(value)                  (PORT_OUT_OUT7_Msk & (_UINT32_(value) << PORT_OUT_OUT7_Pos)) /* Assignment of value for OUT7 in the PORT_OUT register */
#define PORT_OUT_OUT8_Pos                     _UINT32_(8)                                          /* (PORT_OUT) PORT Data Output Value 8 Position */
#define PORT_OUT_OUT8_Msk                     (_UINT32_(0x1) << PORT_OUT_OUT8_Pos)                 /* (PORT_OUT) PORT Data Output Value 8 Mask */
#define PORT_OUT_OUT8(value)                  (PORT_OUT_OUT8_Msk & (_UINT32_(value) << PORT_OUT_OUT8_Pos)) /* Assignment of value for OUT8 in the PORT_OUT register */
#define PORT_OUT_OUT9_Pos                     _UINT32_(9)                                          /* (PORT_OUT) PORT Data Output Value 9 Position */
#define PORT_OUT_OUT9_Msk                     (_UINT32_(0x1) << PORT_OUT_OUT9_Pos)                 /* (PORT_OUT) PORT Data Output Value 9 Mask */
#define PORT_OUT_OUT9(value)                  (PORT_OUT_OUT9_Msk & (_UINT32_(value) << PORT_OUT_OUT9_Pos)) /* Assignment of value for OUT9 in the PORT_OUT register */
#define PORT_OUT_OUT10_Pos                    _UINT32_(10)                                         /* (PORT_OUT) PORT Data Output Value 10 Position */
#define PORT_OUT_OUT10_Msk                    (_UINT32_(0x1) << PORT_OUT_OUT10_Pos)                /* (PORT_OUT) PORT Data Output Value 10 Mask */
#define PORT_OUT_OUT10(value)                 (PORT_OUT_OUT10_Msk & (_UINT32_(value) << PORT_OUT_OUT10_Pos)) /* Assignment of value for OUT10 in the PORT_OUT register */
#define PORT_OUT_OUT11_Pos                    _UINT32_(11)                                         /* (PORT_OUT) PORT Data Output Value 11 Position */
#define PORT_OUT_OUT11_Msk                    (_UINT32_(0x1) << PORT_OUT_OUT11_Pos)                /* (PORT_OUT) PORT Data Output Value 11 Mask */
#define PORT_OUT_OUT11(value)                 (PORT_OUT_OUT11_Msk & (_UINT32_(value) << PORT_OUT_OUT11_Pos)) /* Assignment of value for OUT11 in the PORT_OUT register */
#define PORT_OUT_OUT12_Pos                    _UINT32_(12)                                         /* (PORT_OUT) PORT Data Output Value 12 Position */
#define PORT_OUT_OUT12_Msk                    (_UINT32_(0x1) << PORT_OUT_OUT12_Pos)                /* (PORT_OUT) PORT Data Output Value 12 Mask */
#define PORT_OUT_OUT12(value)                 (PORT_OUT_OUT12_Msk & (_UINT32_(value) << PORT_OUT_OUT12_Pos)) /* Assignment of value for OUT12 in the PORT_OUT register */
#define PORT_OUT_OUT13_Pos                    _UINT32_(13)                                         /* (PORT_OUT) PORT Data Output Value 13 Position */
#define PORT_OUT_OUT13_Msk                    (_UINT32_(0x1) << PORT_OUT_OUT13_Pos)                /* (PORT_OUT) PORT Data Output Value 13 Mask */
#define PORT_OUT_OUT13(value)                 (PORT_OUT_OUT13_Msk & (_UINT32_(value) << PORT_OUT_OUT13_Pos)) /* Assignment of value for OUT13 in the PORT_OUT register */
#define PORT_OUT_OUT14_Pos                    _UINT32_(14)                                         /* (PORT_OUT) PORT Data Output Value 14 Position */
#define PORT_OUT_OUT14_Msk                    (_UINT32_(0x1) << PORT_OUT_OUT14_Pos)                /* (PORT_OUT) PORT Data Output Value 14 Mask */
#define PORT_OUT_OUT14(value)                 (PORT_OUT_OUT14_Msk & (_UINT32_(value) << PORT_OUT_OUT14_Pos)) /* Assignment of value for OUT14 in the PORT_OUT register */
#define PORT_OUT_OUT15_Pos                    _UINT32_(15)                                         /* (PORT_OUT) PORT Data Output Value 15 Position */
#define PORT_OUT_OUT15_Msk                    (_UINT32_(0x1) << PORT_OUT_OUT15_Pos)                /* (PORT_OUT) PORT Data Output Value 15 Mask */
#define PORT_OUT_OUT15(value)                 (PORT_OUT_OUT15_Msk & (_UINT32_(value) << PORT_OUT_OUT15_Pos)) /* Assignment of value for OUT15 in the PORT_OUT register */
#define PORT_OUT_OUT16_Pos                    _UINT32_(16)                                         /* (PORT_OUT) PORT Data Output Value 16 Position */
#define PORT_OUT_OUT16_Msk                    (_UINT32_(0x1) << PORT_OUT_OUT16_Pos)                /* (PORT_OUT) PORT Data Output Value 16 Mask */
#define PORT_OUT_OUT16(value)                 (PORT_OUT_OUT16_Msk & (_UINT32_(value) << PORT_OUT_OUT16_Pos)) /* Assignment of value for OUT16 in the PORT_OUT register */
#define PORT_OUT_OUT17_Pos                    _UINT32_(17)                                         /* (PORT_OUT) PORT Data Output Value 17 Position */
#define PORT_OUT_OUT17_Msk                    (_UINT32_(0x1) << PORT_OUT_OUT17_Pos)                /* (PORT_OUT) PORT Data Output Value 17 Mask */
#define PORT_OUT_OUT17(value)                 (PORT_OUT_OUT17_Msk & (_UINT32_(value) << PORT_OUT_OUT17_Pos)) /* Assignment of value for OUT17 in the PORT_OUT register */
#define PORT_OUT_OUT18_Pos                    _UINT32_(18)                                         /* (PORT_OUT) PORT Data Output Value 18 Position */
#define PORT_OUT_OUT18_Msk                    (_UINT32_(0x1) << PORT_OUT_OUT18_Pos)                /* (PORT_OUT) PORT Data Output Value 18 Mask */
#define PORT_OUT_OUT18(value)                 (PORT_OUT_OUT18_Msk & (_UINT32_(value) << PORT_OUT_OUT18_Pos)) /* Assignment of value for OUT18 in the PORT_OUT register */
#define PORT_OUT_OUT19_Pos                    _UINT32_(19)                                         /* (PORT_OUT) PORT Data Output Value 19 Position */
#define PORT_OUT_OUT19_Msk                    (_UINT32_(0x1) << PORT_OUT_OUT19_Pos)                /* (PORT_OUT) PORT Data Output Value 19 Mask */
#define PORT_OUT_OUT19(value)                 (PORT_OUT_OUT19_Msk & (_UINT32_(value) << PORT_OUT_OUT19_Pos)) /* Assignment of value for OUT19 in the PORT_OUT register */
#define PORT_OUT_OUT20_Pos                    _UINT32_(20)                                         /* (PORT_OUT) PORT Data Output Value 20 Position */
#define PORT_OUT_OUT20_Msk                    (_UINT32_(0x1) << PORT_OUT_OUT20_Pos)                /* (PORT_OUT) PORT Data Output Value 20 Mask */
#define PORT_OUT_OUT20(value)                 (PORT_OUT_OUT20_Msk & (_UINT32_(value) << PORT_OUT_OUT20_Pos)) /* Assignment of value for OUT20 in the PORT_OUT register */
#define PORT_OUT_OUT21_Pos                    _UINT32_(21)                                         /* (PORT_OUT) PORT Data Output Value 21 Position */
#define PORT_OUT_OUT21_Msk                    (_UINT32_(0x1) << PORT_OUT_OUT21_Pos)                /* (PORT_OUT) PORT Data Output Value 21 Mask */
#define PORT_OUT_OUT21(value)                 (PORT_OUT_OUT21_Msk & (_UINT32_(value) << PORT_OUT_OUT21_Pos)) /* Assignment of value for OUT21 in the PORT_OUT register */
#define PORT_OUT_OUT22_Pos                    _UINT32_(22)                                         /* (PORT_OUT) PORT Data Output Value 22 Position */
#define PORT_OUT_OUT22_Msk                    (_UINT32_(0x1) << PORT_OUT_OUT22_Pos)                /* (PORT_OUT) PORT Data Output Value 22 Mask */
#define PORT_OUT_OUT22(value)                 (PORT_OUT_OUT22_Msk & (_UINT32_(value) << PORT_OUT_OUT22_Pos)) /* Assignment of value for OUT22 in the PORT_OUT register */
#define PORT_OUT_OUT23_Pos                    _UINT32_(23)                                         /* (PORT_OUT) PORT Data Output Value 23 Position */
#define PORT_OUT_OUT23_Msk                    (_UINT32_(0x1) << PORT_OUT_OUT23_Pos)                /* (PORT_OUT) PORT Data Output Value 23 Mask */
#define PORT_OUT_OUT23(value)                 (PORT_OUT_OUT23_Msk & (_UINT32_(value) << PORT_OUT_OUT23_Pos)) /* Assignment of value for OUT23 in the PORT_OUT register */
#define PORT_OUT_OUT24_Pos                    _UINT32_(24)                                         /* (PORT_OUT) PORT Data Output Value 24 Position */
#define PORT_OUT_OUT24_Msk                    (_UINT32_(0x1) << PORT_OUT_OUT24_Pos)                /* (PORT_OUT) PORT Data Output Value 24 Mask */
#define PORT_OUT_OUT24(value)                 (PORT_OUT_OUT24_Msk & (_UINT32_(value) << PORT_OUT_OUT24_Pos)) /* Assignment of value for OUT24 in the PORT_OUT register */
#define PORT_OUT_OUT25_Pos                    _UINT32_(25)                                         /* (PORT_OUT) PORT Data Output Value 25 Position */
#define PORT_OUT_OUT25_Msk                    (_UINT32_(0x1) << PORT_OUT_OUT25_Pos)                /* (PORT_OUT) PORT Data Output Value 25 Mask */
#define PORT_OUT_OUT25(value)                 (PORT_OUT_OUT25_Msk & (_UINT32_(value) << PORT_OUT_OUT25_Pos)) /* Assignment of value for OUT25 in the PORT_OUT register */
#define PORT_OUT_OUT26_Pos                    _UINT32_(26)                                         /* (PORT_OUT) PORT Data Output Value 26 Position */
#define PORT_OUT_OUT26_Msk                    (_UINT32_(0x1) << PORT_OUT_OUT26_Pos)                /* (PORT_OUT) PORT Data Output Value 26 Mask */
#define PORT_OUT_OUT26(value)                 (PORT_OUT_OUT26_Msk & (_UINT32_(value) << PORT_OUT_OUT26_Pos)) /* Assignment of value for OUT26 in the PORT_OUT register */
#define PORT_OUT_OUT27_Pos                    _UINT32_(27)                                         /* (PORT_OUT) PORT Data Output Value 27 Position */
#define PORT_OUT_OUT27_Msk                    (_UINT32_(0x1) << PORT_OUT_OUT27_Pos)                /* (PORT_OUT) PORT Data Output Value 27 Mask */
#define PORT_OUT_OUT27(value)                 (PORT_OUT_OUT27_Msk & (_UINT32_(value) << PORT_OUT_OUT27_Pos)) /* Assignment of value for OUT27 in the PORT_OUT register */
#define PORT_OUT_OUT28_Pos                    _UINT32_(28)                                         /* (PORT_OUT) PORT Data Output Value 28 Position */
#define PORT_OUT_OUT28_Msk                    (_UINT32_(0x1) << PORT_OUT_OUT28_Pos)                /* (PORT_OUT) PORT Data Output Value 28 Mask */
#define PORT_OUT_OUT28(value)                 (PORT_OUT_OUT28_Msk & (_UINT32_(value) << PORT_OUT_OUT28_Pos)) /* Assignment of value for OUT28 in the PORT_OUT register */
#define PORT_OUT_OUT29_Pos                    _UINT32_(29)                                         /* (PORT_OUT) PORT Data Output Value 29 Position */
#define PORT_OUT_OUT29_Msk                    (_UINT32_(0x1) << PORT_OUT_OUT29_Pos)                /* (PORT_OUT) PORT Data Output Value 29 Mask */
#define PORT_OUT_OUT29(value)                 (PORT_OUT_OUT29_Msk & (_UINT32_(value) << PORT_OUT_OUT29_Pos)) /* Assignment of value for OUT29 in the PORT_OUT register */
#define PORT_OUT_OUT30_Pos                    _UINT32_(30)                                         /* (PORT_OUT) PORT Data Output Value 30 Position */
#define PORT_OUT_OUT30_Msk                    (_UINT32_(0x1) << PORT_OUT_OUT30_Pos)                /* (PORT_OUT) PORT Data Output Value 30 Mask */
#define PORT_OUT_OUT30(value)                 (PORT_OUT_OUT30_Msk & (_UINT32_(value) << PORT_OUT_OUT30_Pos)) /* Assignment of value for OUT30 in the PORT_OUT register */
#define PORT_OUT_OUT31_Pos                    _UINT32_(31)                                         /* (PORT_OUT) PORT Data Output Value 31 Position */
#define PORT_OUT_OUT31_Msk                    (_UINT32_(0x1) << PORT_OUT_OUT31_Pos)                /* (PORT_OUT) PORT Data Output Value 31 Mask */
#define PORT_OUT_OUT31(value)                 (PORT_OUT_OUT31_Msk & (_UINT32_(value) << PORT_OUT_OUT31_Pos)) /* Assignment of value for OUT31 in the PORT_OUT register */
#define PORT_OUT_Msk                          _UINT32_(0xFFFFFFFF)                                 /* (PORT_OUT) Register Mask  */

#define PORT_OUT_OUT_Pos                      _UINT32_(0)                                          /* (PORT_OUT Position) PORT Data Output Value 3x */
#define PORT_OUT_OUT_Msk                      (_UINT32_(0xFFFFFFFF) << PORT_OUT_OUT_Pos)           /* (PORT_OUT Mask) OUT */
#define PORT_OUT_OUT(value)                   (PORT_OUT_OUT_Msk & (_UINT32_(value) << PORT_OUT_OUT_Pos)) 

/* -------- PORT_OUTCLR : (PORT Offset: 0x14) (R/W 32) Data Output Value Clear -------- */
#define PORT_OUTCLR_RESETVALUE                _UINT32_(0x00)                                       /*  (PORT_OUTCLR) Data Output Value Clear  Reset Value */

