Microchip-MPLAB-Harmony/touch_apps/apps/qt8_selfcap_surface_xpro_board/pic32cm_pl10_cnano_water_tolerance/firmware/src/packs/PIC32CM6408PL10048_DFP/component/port.h
#define PORT_IN_IN0_Pos                       _UINT32_(0)                                          /* (PORT_IN) PORT Data Input Value 0 Position */
#define PORT_IN_IN0_Msk                       (_UINT32_(0x1) << PORT_IN_IN0_Pos)                   /* (PORT_IN) PORT Data Input Value 0 Mask */
#define PORT_IN_IN0(value)                    (PORT_IN_IN0_Msk & (_UINT32_(value) << PORT_IN_IN0_Pos)) /* Assignment of value for IN0 in the PORT_IN register */
#define PORT_IN_IN1_Pos                       _UINT32_(1)                                          /* (PORT_IN) PORT Data Input Value 1 Position */
#define PORT_IN_IN1_Msk                       (_UINT32_(0x1) << PORT_IN_IN1_Pos)                   /* (PORT_IN) PORT Data Input Value 1 Mask */
#define PORT_IN_IN1(value)                    (PORT_IN_IN1_Msk & (_UINT32_(value) << PORT_IN_IN1_Pos)) /* Assignment of value for IN1 in the PORT_IN register */
#define PORT_IN_IN2_Pos                       _UINT32_(2)                                          /* (PORT_IN) PORT Data Input Value 2 Position */
#define PORT_IN_IN2_Msk                       (_UINT32_(0x1) << PORT_IN_IN2_Pos)                   /* (PORT_IN) PORT Data Input Value 2 Mask */
#define PORT_IN_IN2(value)                    (PORT_IN_IN2_Msk & (_UINT32_(value) << PORT_IN_IN2_Pos)) /* Assignment of value for IN2 in the PORT_IN register */
#define PORT_IN_IN3_Pos                       _UINT32_(3)                                          /* (PORT_IN) PORT Data Input Value 3 Position */
#define PORT_IN_IN3_Msk                       (_UINT32_(0x1) << PORT_IN_IN3_Pos)                   /* (PORT_IN) PORT Data Input Value 3 Mask */
#define PORT_IN_IN3(value)                    (PORT_IN_IN3_Msk & (_UINT32_(value) << PORT_IN_IN3_Pos)) /* Assignment of value for IN3 in the PORT_IN register */
#define PORT_IN_IN4_Pos                       _UINT32_(4)                                          /* (PORT_IN) PORT Data Input Value 4 Position */
#define PORT_IN_IN4_Msk                       (_UINT32_(0x1) << PORT_IN_IN4_Pos)                   /* (PORT_IN) PORT Data Input Value 4 Mask */
#define PORT_IN_IN4(value)                    (PORT_IN_IN4_Msk & (_UINT32_(value) << PORT_IN_IN4_Pos)) /* Assignment of value for IN4 in the PORT_IN register */
#define PORT_IN_IN5_Pos                       _UINT32_(5)                                          /* (PORT_IN) PORT Data Input Value 5 Position */
#define PORT_IN_IN5_Msk                       (_UINT32_(0x1) << PORT_IN_IN5_Pos)                   /* (PORT_IN) PORT Data Input Value 5 Mask */
#define PORT_IN_IN5(value)                    (PORT_IN_IN5_Msk & (_UINT32_(value) << PORT_IN_IN5_Pos)) /* Assignment of value for IN5 in the PORT_IN register */
#define PORT_IN_IN6_Pos                       _UINT32_(6)                                          /* (PORT_IN) PORT Data Input Value 6 Position */
#define PORT_IN_IN6_Msk                       (_UINT32_(0x1) << PORT_IN_IN6_Pos)                   /* (PORT_IN) PORT Data Input Value 6 Mask */
#define PORT_IN_IN6(value)                    (PORT_IN_IN6_Msk & (_UINT32_(value) << PORT_IN_IN6_Pos)) /* Assignment of value for IN6 in the PORT_IN register */
#define PORT_IN_IN7_Pos                       _UINT32_(7)                                          /* (PORT_IN) PORT Data Input Value 7 Position */
#define PORT_IN_IN7_Msk                       (_UINT32_(0x1) << PORT_IN_IN7_Pos)                   /* (PORT_IN) PORT Data Input Value 7 Mask */
#define PORT_IN_IN7(value)                    (PORT_IN_IN7_Msk & (_UINT32_(value) << PORT_IN_IN7_Pos)) /* Assignment of value for IN7 in the PORT_IN register */
#define PORT_IN_IN8_Pos                       _UINT32_(8)                                          /* (PORT_IN) PORT Data Input Value 8 Position */
#define PORT_IN_IN8_Msk                       (_UINT32_(0x1) << PORT_IN_IN8_Pos)                   /* (PORT_IN) PORT Data Input Value 8 Mask */
#define PORT_IN_IN8(value)                    (PORT_IN_IN8_Msk & (_UINT32_(value) << PORT_IN_IN8_Pos)) /* Assignment of value for IN8 in the PORT_IN register */
#define PORT_IN_IN9_Pos                       _UINT32_(9)                                          /* (PORT_IN) PORT Data Input Value 9 Position */
#define PORT_IN_IN9_Msk                       (_UINT32_(0x1) << PORT_IN_IN9_Pos)                   /* (PORT_IN) PORT Data Input Value 9 Mask */
#define PORT_IN_IN9(value)                    (PORT_IN_IN9_Msk & (_UINT32_(value) << PORT_IN_IN9_Pos)) /* Assignment of value for IN9 in the PORT_IN register */
#define PORT_IN_IN10_Pos                      _UINT32_(10)                                         /* (PORT_IN) PORT Data Input Value 10 Position */
#define PORT_IN_IN10_Msk                      (_UINT32_(0x1) << PORT_IN_IN10_Pos)                  /* (PORT_IN) PORT Data Input Value 10 Mask */
#define PORT_IN_IN10(value)                   (PORT_IN_IN10_Msk & (_UINT32_(value) << PORT_IN_IN10_Pos)) /* Assignment of value for IN10 in the PORT_IN register */
#define PORT_IN_IN11_Pos                      _UINT32_(11)                                         /* (PORT_IN) PORT Data Input Value 11 Position */
#define PORT_IN_IN11_Msk                      (_UINT32_(0x1) << PORT_IN_IN11_Pos)                  /* (PORT_IN) PORT Data Input Value 11 Mask */
#define PORT_IN_IN11(value)                   (PORT_IN_IN11_Msk & (_UINT32_(value) << PORT_IN_IN11_Pos)) /* Assignment of value for IN11 in the PORT_IN register */
#define PORT_IN_IN12_Pos                      _UINT32_(12)                                         /* (PORT_IN) PORT Data Input Value 12 Position */
#define PORT_IN_IN12_Msk                      (_UINT32_(0x1) << PORT_IN_IN12_Pos)                  /* (PORT_IN) PORT Data Input Value 12 Mask */
#define PORT_IN_IN12(value)                   (PORT_IN_IN12_Msk & (_UINT32_(value) << PORT_IN_IN12_Pos)) /* Assignment of value for IN12 in the PORT_IN register */
#define PORT_IN_IN13_Pos                      _UINT32_(13)                                         /* (PORT_IN) PORT Data Input Value 13 Position */
#define PORT_IN_IN13_Msk                      (_UINT32_(0x1) << PORT_IN_IN13_Pos)                  /* (PORT_IN) PORT Data Input Value 13 Mask */
#define PORT_IN_IN13(value)                   (PORT_IN_IN13_Msk & (_UINT32_(value) << PORT_IN_IN13_Pos)) /* Assignment of value for IN13 in the PORT_IN register */
#define PORT_IN_IN14_Pos                      _UINT32_(14)                                         /* (PORT_IN) PORT Data Input Value 14 Position */
#define PORT_IN_IN14_Msk                      (_UINT32_(0x1) << PORT_IN_IN14_Pos)                  /* (PORT_IN) PORT Data Input Value 14 Mask */
#define PORT_IN_IN14(value)                   (PORT_IN_IN14_Msk & (_UINT32_(value) << PORT_IN_IN14_Pos)) /* Assignment of value for IN14 in the PORT_IN register */
#define PORT_IN_IN15_Pos                      _UINT32_(15)                                         /* (PORT_IN) PORT Data Input Value 15 Position */
#define PORT_IN_IN15_Msk                      (_UINT32_(0x1) << PORT_IN_IN15_Pos)                  /* (PORT_IN) PORT Data Input Value 15 Mask */
#define PORT_IN_IN15(value)                   (PORT_IN_IN15_Msk & (_UINT32_(value) << PORT_IN_IN15_Pos)) /* Assignment of value for IN15 in the PORT_IN register */
#define PORT_IN_IN16_Pos                      _UINT32_(16)                                         /* (PORT_IN) PORT Data Input Value 16 Position */
#define PORT_IN_IN16_Msk                      (_UINT32_(0x1) << PORT_IN_IN16_Pos)                  /* (PORT_IN) PORT Data Input Value 16 Mask */
#define PORT_IN_IN16(value)                   (PORT_IN_IN16_Msk & (_UINT32_(value) << PORT_IN_IN16_Pos)) /* Assignment of value for IN16 in the PORT_IN register */
#define PORT_IN_IN17_Pos                      _UINT32_(17)                                         /* (PORT_IN) PORT Data Input Value 17 Position */
#define PORT_IN_IN17_Msk                      (_UINT32_(0x1) << PORT_IN_IN17_Pos)                  /* (PORT_IN) PORT Data Input Value 17 Mask */
#define PORT_IN_IN17(value)                   (PORT_IN_IN17_Msk & (_UINT32_(value) << PORT_IN_IN17_Pos)) /* Assignment of value for IN17 in the PORT_IN register */
#define PORT_IN_IN18_Pos                      _UINT32_(18)                                         /* (PORT_IN) PORT Data Input Value 18 Position */
#define PORT_IN_IN18_Msk                      (_UINT32_(0x1) << PORT_IN_IN18_Pos)                  /* (PORT_IN) PORT Data Input Value 18 Mask */
#define PORT_IN_IN18(value)                   (PORT_IN_IN18_Msk & (_UINT32_(value) << PORT_IN_IN18_Pos)) /* Assignment of value for IN18 in the PORT_IN register */
#define PORT_IN_IN19_Pos                      _UINT32_(19)                                         /* (PORT_IN) PORT Data Input Value 19 Position */
#define PORT_IN_IN19_Msk                      (_UINT32_(0x1) << PORT_IN_IN19_Pos)                  /* (PORT_IN) PORT Data Input Value 19 Mask */
#define PORT_IN_IN19(value)                   (PORT_IN_IN19_Msk & (_UINT32_(value) << PORT_IN_IN19_Pos)) /* Assignment of value for IN19 in the PORT_IN register */
#define PORT_IN_IN20_Pos                      _UINT32_(20)                                         /* (PORT_IN) PORT Data Input Value 20 Position */
#define PORT_IN_IN20_Msk                      (_UINT32_(0x1) << PORT_IN_IN20_Pos)                  /* (PORT_IN) PORT Data Input Value 20 Mask */
#define PORT_IN_IN20(value)                   (PORT_IN_IN20_Msk & (_UINT32_(value) << PORT_IN_IN20_Pos)) /* Assignment of value for IN20 in the PORT_IN register */
#define PORT_IN_IN21_Pos                      _UINT32_(21)                                         /* (PORT_IN) PORT Data Input Value 21 Position */
#define PORT_IN_IN21_Msk                      (_UINT32_(0x1) << PORT_IN_IN21_Pos)                  /* (PORT_IN) PORT Data Input Value 21 Mask */
#define PORT_IN_IN21(value)                   (PORT_IN_IN21_Msk & (_UINT32_(value) << PORT_IN_IN21_Pos)) /* Assignment of value for IN21 in the PORT_IN register */
#define PORT_IN_IN22_Pos                      _UINT32_(22)                                         /* (PORT_IN) PORT Data Input Value 22 Position */
#define PORT_IN_IN22_Msk                      (_UINT32_(0x1) << PORT_IN_IN22_Pos)                  /* (PORT_IN) PORT Data Input Value 22 Mask */
#define PORT_IN_IN22(value)                   (PORT_IN_IN22_Msk & (_UINT32_(value) << PORT_IN_IN22_Pos)) /* Assignment of value for IN22 in the PORT_IN register */
#define PORT_IN_IN23_Pos                      _UINT32_(23)                                         /* (PORT_IN) PORT Data Input Value 23 Position */
#define PORT_IN_IN23_Msk                      (_UINT32_(0x1) << PORT_IN_IN23_Pos)                  /* (PORT_IN) PORT Data Input Value 23 Mask */
#define PORT_IN_IN23(value)                   (PORT_IN_IN23_Msk & (_UINT32_(value) << PORT_IN_IN23_Pos)) /* Assignment of value for IN23 in the PORT_IN register */
#define PORT_IN_IN24_Pos                      _UINT32_(24)                                         /* (PORT_IN) PORT Data Input Value 24 Position */
#define PORT_IN_IN24_Msk                      (_UINT32_(0x1) << PORT_IN_IN24_Pos)                  /* (PORT_IN) PORT Data Input Value 24 Mask */
#define PORT_IN_IN24(value)                   (PORT_IN_IN24_Msk & (_UINT32_(value) << PORT_IN_IN24_Pos)) /* Assignment of value for IN24 in the PORT_IN register */
#define PORT_IN_IN25_Pos                      _UINT32_(25)                                         /* (PORT_IN) PORT Data Input Value 25 Position */
#define PORT_IN_IN25_Msk                      (_UINT32_(0x1) << PORT_IN_IN25_Pos)                  /* (PORT_IN) PORT Data Input Value 25 Mask */
#define PORT_IN_IN25(value)                   (PORT_IN_IN25_Msk & (_UINT32_(value) << PORT_IN_IN25_Pos)) /* Assignment of value for IN25 in the PORT_IN register */
#define PORT_IN_IN26_Pos                      _UINT32_(26)                                         /* (PORT_IN) PORT Data Input Value 26 Position */
#define PORT_IN_IN26_Msk                      (_UINT32_(0x1) << PORT_IN_IN26_Pos)                  /* (PORT_IN) PORT Data Input Value 26 Mask */
#define PORT_IN_IN26(value)                   (PORT_IN_IN26_Msk & (_UINT32_(value) << PORT_IN_IN26_Pos)) /* Assignment of value for IN26 in the PORT_IN register */
#define PORT_IN_IN27_Pos                      _UINT32_(27)                                         /* (PORT_IN) PORT Data Input Value 27 Position */
#define PORT_IN_IN27_Msk                      (_UINT32_(0x1) << PORT_IN_IN27_Pos)                  /* (PORT_IN) PORT Data Input Value 27 Mask */
#define PORT_IN_IN27(value)                   (PORT_IN_IN27_Msk & (_UINT32_(value) << PORT_IN_IN27_Pos)) /* Assignment of value for IN27 in the PORT_IN register */
#define PORT_IN_IN28_Pos                      _UINT32_(28)                                         /* (PORT_IN) PORT Data Input Value 28 Position */
#define PORT_IN_IN28_Msk                      (_UINT32_(0x1) << PORT_IN_IN28_Pos)                  /* (PORT_IN) PORT Data Input Value 28 Mask */
#define PORT_IN_IN28(value)                   (PORT_IN_IN28_Msk & (_UINT32_(value) << PORT_IN_IN28_Pos)) /* Assignment of value for IN28 in the PORT_IN register */
#define PORT_IN_IN29_Pos                      _UINT32_(29)                                         /* (PORT_IN) PORT Data Input Value 29 Position */
#define PORT_IN_IN29_Msk                      (_UINT32_(0x1) << PORT_IN_IN29_Pos)                  /* (PORT_IN) PORT Data Input Value 29 Mask */
#define PORT_IN_IN29(value)                   (PORT_IN_IN29_Msk & (_UINT32_(value) << PORT_IN_IN29_Pos)) /* Assignment of value for IN29 in the PORT_IN register */
#define PORT_IN_IN30_Pos                      _UINT32_(30)                                         /* (PORT_IN) PORT Data Input Value 30 Position */
#define PORT_IN_IN30_Msk                      (_UINT32_(0x1) << PORT_IN_IN30_Pos)                  /* (PORT_IN) PORT Data Input Value 30 Mask */
#define PORT_IN_IN30(value)                   (PORT_IN_IN30_Msk & (_UINT32_(value) << PORT_IN_IN30_Pos)) /* Assignment of value for IN30 in the PORT_IN register */
#define PORT_IN_IN31_Pos                      _UINT32_(31)                                         /* (PORT_IN) PORT Data Input Value 31 Position */
#define PORT_IN_IN31_Msk                      (_UINT32_(0x1) << PORT_IN_IN31_Pos)                  /* (PORT_IN) PORT Data Input Value 31 Mask */
#define PORT_IN_IN31(value)                   (PORT_IN_IN31_Msk & (_UINT32_(value) << PORT_IN_IN31_Pos)) /* Assignment of value for IN31 in the PORT_IN register */
#define PORT_IN_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (PORT_IN) Register Mask  */

#define PORT_IN_IN_Pos                        _UINT32_(0)                                          /* (PORT_IN Position) PORT Data Input Value 3x */
#define PORT_IN_IN_Msk                        (_UINT32_(0xFFFFFFFF) << PORT_IN_IN_Pos)             /* (PORT_IN Mask) IN */
#define PORT_IN_IN(value)                     (PORT_IN_IN_Msk & (_UINT32_(value) << PORT_IN_IN_Pos)) 

/* -------- PORT_CTRL : (PORT Offset: 0x24) (R/W 32) Control -------- */
#define PORT_CTRL_RESETVALUE                  _UINT32_(0x00)                                       /*  (PORT_CTRL) Control  Reset Value */

