Microchip-MPLAB-Harmony/touch_apps/apps/qt8_selfcap_surface_xpro_board/pic32cm_pl10_cnano_water_tolerance/firmware/src/packs/PIC32CM6408PL10048_DFP/component/port.h
#define PORT_CTRL_SAMPLING0_Pos               _UINT32_(0)                                          /* (PORT_CTRL) Input Sampling Mode 0 Position */
#define PORT_CTRL_SAMPLING0_Msk               (_UINT32_(0x1) << PORT_CTRL_SAMPLING0_Pos)           /* (PORT_CTRL) Input Sampling Mode 0 Mask */
#define PORT_CTRL_SAMPLING0(value)            (PORT_CTRL_SAMPLING0_Msk & (_UINT32_(value) << PORT_CTRL_SAMPLING0_Pos)) /* Assignment of value for SAMPLING0 in the PORT_CTRL register */
#define PORT_CTRL_SAMPLING1_Pos               _UINT32_(1)                                          /* (PORT_CTRL) Input Sampling Mode 1 Position */
#define PORT_CTRL_SAMPLING1_Msk               (_UINT32_(0x1) << PORT_CTRL_SAMPLING1_Pos)           /* (PORT_CTRL) Input Sampling Mode 1 Mask */
#define PORT_CTRL_SAMPLING1(value)            (PORT_CTRL_SAMPLING1_Msk & (_UINT32_(value) << PORT_CTRL_SAMPLING1_Pos)) /* Assignment of value for SAMPLING1 in the PORT_CTRL register */
#define PORT_CTRL_SAMPLING2_Pos               _UINT32_(2)                                          /* (PORT_CTRL) Input Sampling Mode 2 Position */
#define PORT_CTRL_SAMPLING2_Msk               (_UINT32_(0x1) << PORT_CTRL_SAMPLING2_Pos)           /* (PORT_CTRL) Input Sampling Mode 2 Mask */
#define PORT_CTRL_SAMPLING2(value)            (PORT_CTRL_SAMPLING2_Msk & (_UINT32_(value) << PORT_CTRL_SAMPLING2_Pos)) /* Assignment of value for SAMPLING2 in the PORT_CTRL register */
#define PORT_CTRL_SAMPLING3_Pos               _UINT32_(3)                                          /* (PORT_CTRL) Input Sampling Mode 3 Position */
#define PORT_CTRL_SAMPLING3_Msk               (_UINT32_(0x1) << PORT_CTRL_SAMPLING3_Pos)           /* (PORT_CTRL) Input Sampling Mode 3 Mask */
#define PORT_CTRL_SAMPLING3(value)            (PORT_CTRL_SAMPLING3_Msk & (_UINT32_(value) << PORT_CTRL_SAMPLING3_Pos)) /* Assignment of value for SAMPLING3 in the PORT_CTRL register */
#define PORT_CTRL_SAMPLING4_Pos               _UINT32_(4)                                          /* (PORT_CTRL) Input Sampling Mode 4 Position */
#define PORT_CTRL_SAMPLING4_Msk               (_UINT32_(0x1) << PORT_CTRL_SAMPLING4_Pos)           /* (PORT_CTRL) Input Sampling Mode 4 Mask */
#define PORT_CTRL_SAMPLING4(value)            (PORT_CTRL_SAMPLING4_Msk & (_UINT32_(value) << PORT_CTRL_SAMPLING4_Pos)) /* Assignment of value for SAMPLING4 in the PORT_CTRL register */
#define PORT_CTRL_SAMPLING5_Pos               _UINT32_(5)                                          /* (PORT_CTRL) Input Sampling Mode 5 Position */
#define PORT_CTRL_SAMPLING5_Msk               (_UINT32_(0x1) << PORT_CTRL_SAMPLING5_Pos)           /* (PORT_CTRL) Input Sampling Mode 5 Mask */
#define PORT_CTRL_SAMPLING5(value)            (PORT_CTRL_SAMPLING5_Msk & (_UINT32_(value) << PORT_CTRL_SAMPLING5_Pos)) /* Assignment of value for SAMPLING5 in the PORT_CTRL register */
#define PORT_CTRL_SAMPLING6_Pos               _UINT32_(6)                                          /* (PORT_CTRL) Input Sampling Mode 6 Position */
#define PORT_CTRL_SAMPLING6_Msk               (_UINT32_(0x1) << PORT_CTRL_SAMPLING6_Pos)           /* (PORT_CTRL) Input Sampling Mode 6 Mask */
#define PORT_CTRL_SAMPLING6(value)            (PORT_CTRL_SAMPLING6_Msk & (_UINT32_(value) << PORT_CTRL_SAMPLING6_Pos)) /* Assignment of value for SAMPLING6 in the PORT_CTRL register */
#define PORT_CTRL_SAMPLING7_Pos               _UINT32_(7)                                          /* (PORT_CTRL) Input Sampling Mode 7 Position */
#define PORT_CTRL_SAMPLING7_Msk               (_UINT32_(0x1) << PORT_CTRL_SAMPLING7_Pos)           /* (PORT_CTRL) Input Sampling Mode 7 Mask */
#define PORT_CTRL_SAMPLING7(value)            (PORT_CTRL_SAMPLING7_Msk & (_UINT32_(value) << PORT_CTRL_SAMPLING7_Pos)) /* Assignment of value for SAMPLING7 in the PORT_CTRL register */
#define PORT_CTRL_SAMPLING8_Pos               _UINT32_(8)                                          /* (PORT_CTRL) Input Sampling Mode 8 Position */
#define PORT_CTRL_SAMPLING8_Msk               (_UINT32_(0x1) << PORT_CTRL_SAMPLING8_Pos)           /* (PORT_CTRL) Input Sampling Mode 8 Mask */
#define PORT_CTRL_SAMPLING8(value)            (PORT_CTRL_SAMPLING8_Msk & (_UINT32_(value) << PORT_CTRL_SAMPLING8_Pos)) /* Assignment of value for SAMPLING8 in the PORT_CTRL register */
#define PORT_CTRL_SAMPLING9_Pos               _UINT32_(9)                                          /* (PORT_CTRL) Input Sampling Mode 9 Position */
#define PORT_CTRL_SAMPLING9_Msk               (_UINT32_(0x1) << PORT_CTRL_SAMPLING9_Pos)           /* (PORT_CTRL) Input Sampling Mode 9 Mask */
#define PORT_CTRL_SAMPLING9(value)            (PORT_CTRL_SAMPLING9_Msk & (_UINT32_(value) << PORT_CTRL_SAMPLING9_Pos)) /* Assignment of value for SAMPLING9 in the PORT_CTRL register */
#define PORT_CTRL_SAMPLING10_Pos              _UINT32_(10)                                         /* (PORT_CTRL) Input Sampling Mode 10 Position */
#define PORT_CTRL_SAMPLING10_Msk              (_UINT32_(0x1) << PORT_CTRL_SAMPLING10_Pos)          /* (PORT_CTRL) Input Sampling Mode 10 Mask */
#define PORT_CTRL_SAMPLING10(value)           (PORT_CTRL_SAMPLING10_Msk & (_UINT32_(value) << PORT_CTRL_SAMPLING10_Pos)) /* Assignment of value for SAMPLING10 in the PORT_CTRL register */
#define PORT_CTRL_SAMPLING11_Pos              _UINT32_(11)                                         /* (PORT_CTRL) Input Sampling Mode 11 Position */
#define PORT_CTRL_SAMPLING11_Msk              (_UINT32_(0x1) << PORT_CTRL_SAMPLING11_Pos)          /* (PORT_CTRL) Input Sampling Mode 11 Mask */
#define PORT_CTRL_SAMPLING11(value)           (PORT_CTRL_SAMPLING11_Msk & (_UINT32_(value) << PORT_CTRL_SAMPLING11_Pos)) /* Assignment of value for SAMPLING11 in the PORT_CTRL register */
#define PORT_CTRL_SAMPLING12_Pos              _UINT32_(12)                                         /* (PORT_CTRL) Input Sampling Mode 12 Position */
#define PORT_CTRL_SAMPLING12_Msk              (_UINT32_(0x1) << PORT_CTRL_SAMPLING12_Pos)          /* (PORT_CTRL) Input Sampling Mode 12 Mask */
#define PORT_CTRL_SAMPLING12(value)           (PORT_CTRL_SAMPLING12_Msk & (_UINT32_(value) << PORT_CTRL_SAMPLING12_Pos)) /* Assignment of value for SAMPLING12 in the PORT_CTRL register */
#define PORT_CTRL_SAMPLING13_Pos              _UINT32_(13)                                         /* (PORT_CTRL) Input Sampling Mode 13 Position */
#define PORT_CTRL_SAMPLING13_Msk              (_UINT32_(0x1) << PORT_CTRL_SAMPLING13_Pos)          /* (PORT_CTRL) Input Sampling Mode 13 Mask */
#define PORT_CTRL_SAMPLING13(value)           (PORT_CTRL_SAMPLING13_Msk & (_UINT32_(value) << PORT_CTRL_SAMPLING13_Pos)) /* Assignment of value for SAMPLING13 in the PORT_CTRL register */
#define PORT_CTRL_SAMPLING14_Pos              _UINT32_(14)                                         /* (PORT_CTRL) Input Sampling Mode 14 Position */
#define PORT_CTRL_SAMPLING14_Msk              (_UINT32_(0x1) << PORT_CTRL_SAMPLING14_Pos)          /* (PORT_CTRL) Input Sampling Mode 14 Mask */
#define PORT_CTRL_SAMPLING14(value)           (PORT_CTRL_SAMPLING14_Msk & (_UINT32_(value) << PORT_CTRL_SAMPLING14_Pos)) /* Assignment of value for SAMPLING14 in the PORT_CTRL register */
#define PORT_CTRL_SAMPLING15_Pos              _UINT32_(15)                                         /* (PORT_CTRL) Input Sampling Mode 15 Position */
#define PORT_CTRL_SAMPLING15_Msk              (_UINT32_(0x1) << PORT_CTRL_SAMPLING15_Pos)          /* (PORT_CTRL) Input Sampling Mode 15 Mask */
#define PORT_CTRL_SAMPLING15(value)           (PORT_CTRL_SAMPLING15_Msk & (_UINT32_(value) << PORT_CTRL_SAMPLING15_Pos)) /* Assignment of value for SAMPLING15 in the PORT_CTRL register */
#define PORT_CTRL_SAMPLING16_Pos              _UINT32_(16)                                         /* (PORT_CTRL) Input Sampling Mode 16 Position */
#define PORT_CTRL_SAMPLING16_Msk              (_UINT32_(0x1) << PORT_CTRL_SAMPLING16_Pos)          /* (PORT_CTRL) Input Sampling Mode 16 Mask */
#define PORT_CTRL_SAMPLING16(value)           (PORT_CTRL_SAMPLING16_Msk & (_UINT32_(value) << PORT_CTRL_SAMPLING16_Pos)) /* Assignment of value for SAMPLING16 in the PORT_CTRL register */
#define PORT_CTRL_SAMPLING17_Pos              _UINT32_(17)                                         /* (PORT_CTRL) Input Sampling Mode 17 Position */
#define PORT_CTRL_SAMPLING17_Msk              (_UINT32_(0x1) << PORT_CTRL_SAMPLING17_Pos)          /* (PORT_CTRL) Input Sampling Mode 17 Mask */
#define PORT_CTRL_SAMPLING17(value)           (PORT_CTRL_SAMPLING17_Msk & (_UINT32_(value) << PORT_CTRL_SAMPLING17_Pos)) /* Assignment of value for SAMPLING17 in the PORT_CTRL register */
#define PORT_CTRL_SAMPLING18_Pos              _UINT32_(18)                                         /* (PORT_CTRL) Input Sampling Mode 18 Position */
#define PORT_CTRL_SAMPLING18_Msk              (_UINT32_(0x1) << PORT_CTRL_SAMPLING18_Pos)          /* (PORT_CTRL) Input Sampling Mode 18 Mask */
#define PORT_CTRL_SAMPLING18(value)           (PORT_CTRL_SAMPLING18_Msk & (_UINT32_(value) << PORT_CTRL_SAMPLING18_Pos)) /* Assignment of value for SAMPLING18 in the PORT_CTRL register */
#define PORT_CTRL_SAMPLING19_Pos              _UINT32_(19)                                         /* (PORT_CTRL) Input Sampling Mode 19 Position */
#define PORT_CTRL_SAMPLING19_Msk              (_UINT32_(0x1) << PORT_CTRL_SAMPLING19_Pos)          /* (PORT_CTRL) Input Sampling Mode 19 Mask */
#define PORT_CTRL_SAMPLING19(value)           (PORT_CTRL_SAMPLING19_Msk & (_UINT32_(value) << PORT_CTRL_SAMPLING19_Pos)) /* Assignment of value for SAMPLING19 in the PORT_CTRL register */
#define PORT_CTRL_SAMPLING20_Pos              _UINT32_(20)                                         /* (PORT_CTRL) Input Sampling Mode 20 Position */
#define PORT_CTRL_SAMPLING20_Msk              (_UINT32_(0x1) << PORT_CTRL_SAMPLING20_Pos)          /* (PORT_CTRL) Input Sampling Mode 20 Mask */
#define PORT_CTRL_SAMPLING20(value)           (PORT_CTRL_SAMPLING20_Msk & (_UINT32_(value) << PORT_CTRL_SAMPLING20_Pos)) /* Assignment of value for SAMPLING20 in the PORT_CTRL register */
#define PORT_CTRL_SAMPLING21_Pos              _UINT32_(21)                                         /* (PORT_CTRL) Input Sampling Mode 21 Position */
#define PORT_CTRL_SAMPLING21_Msk              (_UINT32_(0x1) << PORT_CTRL_SAMPLING21_Pos)          /* (PORT_CTRL) Input Sampling Mode 21 Mask */
#define PORT_CTRL_SAMPLING21(value)           (PORT_CTRL_SAMPLING21_Msk & (_UINT32_(value) << PORT_CTRL_SAMPLING21_Pos)) /* Assignment of value for SAMPLING21 in the PORT_CTRL register */
#define PORT_CTRL_SAMPLING22_Pos              _UINT32_(22)                                         /* (PORT_CTRL) Input Sampling Mode 22 Position */
#define PORT_CTRL_SAMPLING22_Msk              (_UINT32_(0x1) << PORT_CTRL_SAMPLING22_Pos)          /* (PORT_CTRL) Input Sampling Mode 22 Mask */
#define PORT_CTRL_SAMPLING22(value)           (PORT_CTRL_SAMPLING22_Msk & (_UINT32_(value) << PORT_CTRL_SAMPLING22_Pos)) /* Assignment of value for SAMPLING22 in the PORT_CTRL register */
#define PORT_CTRL_SAMPLING23_Pos              _UINT32_(23)                                         /* (PORT_CTRL) Input Sampling Mode 23 Position */
#define PORT_CTRL_SAMPLING23_Msk              (_UINT32_(0x1) << PORT_CTRL_SAMPLING23_Pos)          /* (PORT_CTRL) Input Sampling Mode 23 Mask */
#define PORT_CTRL_SAMPLING23(value)           (PORT_CTRL_SAMPLING23_Msk & (_UINT32_(value) << PORT_CTRL_SAMPLING23_Pos)) /* Assignment of value for SAMPLING23 in the PORT_CTRL register */
#define PORT_CTRL_SAMPLING24_Pos              _UINT32_(24)                                         /* (PORT_CTRL) Input Sampling Mode 24 Position */
#define PORT_CTRL_SAMPLING24_Msk              (_UINT32_(0x1) << PORT_CTRL_SAMPLING24_Pos)          /* (PORT_CTRL) Input Sampling Mode 24 Mask */
#define PORT_CTRL_SAMPLING24(value)           (PORT_CTRL_SAMPLING24_Msk & (_UINT32_(value) << PORT_CTRL_SAMPLING24_Pos)) /* Assignment of value for SAMPLING24 in the PORT_CTRL register */
#define PORT_CTRL_SAMPLING25_Pos              _UINT32_(25)                                         /* (PORT_CTRL) Input Sampling Mode 25 Position */
#define PORT_CTRL_SAMPLING25_Msk              (_UINT32_(0x1) << PORT_CTRL_SAMPLING25_Pos)          /* (PORT_CTRL) Input Sampling Mode 25 Mask */
#define PORT_CTRL_SAMPLING25(value)           (PORT_CTRL_SAMPLING25_Msk & (_UINT32_(value) << PORT_CTRL_SAMPLING25_Pos)) /* Assignment of value for SAMPLING25 in the PORT_CTRL register */
#define PORT_CTRL_SAMPLING26_Pos              _UINT32_(26)                                         /* (PORT_CTRL) Input Sampling Mode 26 Position */
#define PORT_CTRL_SAMPLING26_Msk              (_UINT32_(0x1) << PORT_CTRL_SAMPLING26_Pos)          /* (PORT_CTRL) Input Sampling Mode 26 Mask */
#define PORT_CTRL_SAMPLING26(value)           (PORT_CTRL_SAMPLING26_Msk & (_UINT32_(value) << PORT_CTRL_SAMPLING26_Pos)) /* Assignment of value for SAMPLING26 in the PORT_CTRL register */
#define PORT_CTRL_SAMPLING27_Pos              _UINT32_(27)                                         /* (PORT_CTRL) Input Sampling Mode 27 Position */
#define PORT_CTRL_SAMPLING27_Msk              (_UINT32_(0x1) << PORT_CTRL_SAMPLING27_Pos)          /* (PORT_CTRL) Input Sampling Mode 27 Mask */
#define PORT_CTRL_SAMPLING27(value)           (PORT_CTRL_SAMPLING27_Msk & (_UINT32_(value) << PORT_CTRL_SAMPLING27_Pos)) /* Assignment of value for SAMPLING27 in the PORT_CTRL register */
#define PORT_CTRL_SAMPLING28_Pos              _UINT32_(28)                                         /* (PORT_CTRL) Input Sampling Mode 28 Position */
#define PORT_CTRL_SAMPLING28_Msk              (_UINT32_(0x1) << PORT_CTRL_SAMPLING28_Pos)          /* (PORT_CTRL) Input Sampling Mode 28 Mask */
#define PORT_CTRL_SAMPLING28(value)           (PORT_CTRL_SAMPLING28_Msk & (_UINT32_(value) << PORT_CTRL_SAMPLING28_Pos)) /* Assignment of value for SAMPLING28 in the PORT_CTRL register */
#define PORT_CTRL_SAMPLING29_Pos              _UINT32_(29)                                         /* (PORT_CTRL) Input Sampling Mode 29 Position */
#define PORT_CTRL_SAMPLING29_Msk              (_UINT32_(0x1) << PORT_CTRL_SAMPLING29_Pos)          /* (PORT_CTRL) Input Sampling Mode 29 Mask */
#define PORT_CTRL_SAMPLING29(value)           (PORT_CTRL_SAMPLING29_Msk & (_UINT32_(value) << PORT_CTRL_SAMPLING29_Pos)) /* Assignment of value for SAMPLING29 in the PORT_CTRL register */
#define PORT_CTRL_SAMPLING30_Pos              _UINT32_(30)                                         /* (PORT_CTRL) Input Sampling Mode 30 Position */
#define PORT_CTRL_SAMPLING30_Msk              (_UINT32_(0x1) << PORT_CTRL_SAMPLING30_Pos)          /* (PORT_CTRL) Input Sampling Mode 30 Mask */
#define PORT_CTRL_SAMPLING30(value)           (PORT_CTRL_SAMPLING30_Msk & (_UINT32_(value) << PORT_CTRL_SAMPLING30_Pos)) /* Assignment of value for SAMPLING30 in the PORT_CTRL register */
#define PORT_CTRL_SAMPLING31_Pos              _UINT32_(31)                                         /* (PORT_CTRL) Input Sampling Mode 31 Position */
#define PORT_CTRL_SAMPLING31_Msk              (_UINT32_(0x1) << PORT_CTRL_SAMPLING31_Pos)          /* (PORT_CTRL) Input Sampling Mode 31 Mask */
#define PORT_CTRL_SAMPLING31(value)           (PORT_CTRL_SAMPLING31_Msk & (_UINT32_(value) << PORT_CTRL_SAMPLING31_Pos)) /* Assignment of value for SAMPLING31 in the PORT_CTRL register */
#define PORT_CTRL_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (PORT_CTRL) Register Mask  */

#define PORT_CTRL_SAMPLING_Pos                _UINT32_(0)                                          /* (PORT_CTRL Position) Input Sampling Mode 3x */
#define PORT_CTRL_SAMPLING_Msk                (_UINT32_(0xFFFFFFFF) << PORT_CTRL_SAMPLING_Pos)     /* (PORT_CTRL Mask) SAMPLING */
#define PORT_CTRL_SAMPLING(value)             (PORT_CTRL_SAMPLING_Msk & (_UINT32_(value) << PORT_CTRL_SAMPLING_Pos)) 

