Microchip-MPLAB-Harmony/touch_apps/apps/qt8_selfcap_surface_xpro_board/pic32cm_pl10_cnano_water_tolerance/firmware/src/packs/PIC32CM6408PL10048_DFP/component/port.h
/* -------- PORT_WRCONFIG : (PORT Offset: 0x28) ( /W 32) Write Configuration -------- */
#define PORT_WRCONFIG_RESETVALUE              _UINT32_(0x00)                                       /*  (PORT_WRCONFIG) Write Configuration  Reset Value */

#define PORT_WRCONFIG_PINMASK_Pos             _UINT32_(0)                                          /* (PORT_WRCONFIG) Pin Mask for Multiple Pin Configuration Position */
#define PORT_WRCONFIG_PINMASK_Msk             (_UINT32_(0xFFFF) << PORT_WRCONFIG_PINMASK_Pos)      /* (PORT_WRCONFIG) Pin Mask for Multiple Pin Configuration Mask */
#define PORT_WRCONFIG_PINMASK(value)          (PORT_WRCONFIG_PINMASK_Msk & (_UINT32_(value) << PORT_WRCONFIG_PINMASK_Pos)) /* Assignment of value for PINMASK in the PORT_WRCONFIG register */
#define PORT_WRCONFIG_PMUXEN_Pos              _UINT32_(16)                                         /* (PORT_WRCONFIG) Peripheral Multiplexer Enable Position */
#define PORT_WRCONFIG_PMUXEN_Msk              (_UINT32_(0x1) << PORT_WRCONFIG_PMUXEN_Pos)          /* (PORT_WRCONFIG) Peripheral Multiplexer Enable Mask */
#define PORT_WRCONFIG_PMUXEN(value)           (PORT_WRCONFIG_PMUXEN_Msk & (_UINT32_(value) << PORT_WRCONFIG_PMUXEN_Pos)) /* Assignment of value for PMUXEN in the PORT_WRCONFIG register */
#define PORT_WRCONFIG_INEN_Pos                _UINT32_(17)                                         /* (PORT_WRCONFIG) Input Enable Position */
#define PORT_WRCONFIG_INEN_Msk                (_UINT32_(0x1) << PORT_WRCONFIG_INEN_Pos)            /* (PORT_WRCONFIG) Input Enable Mask */
#define PORT_WRCONFIG_INEN(value)             (PORT_WRCONFIG_INEN_Msk & (_UINT32_(value) << PORT_WRCONFIG_INEN_Pos)) /* Assignment of value for INEN in the PORT_WRCONFIG register */
#define PORT_WRCONFIG_PULLEN_Pos              _UINT32_(18)                                         /* (PORT_WRCONFIG) Pull Enable Position */
#define PORT_WRCONFIG_PULLEN_Msk              (_UINT32_(0x1) << PORT_WRCONFIG_PULLEN_Pos)          /* (PORT_WRCONFIG) Pull Enable Mask */
#define PORT_WRCONFIG_PULLEN(value)           (PORT_WRCONFIG_PULLEN_Msk & (_UINT32_(value) << PORT_WRCONFIG_PULLEN_Pos)) /* Assignment of value for PULLEN in the PORT_WRCONFIG register */
#define PORT_WRCONFIG_SLEWLIM_Pos             _UINT32_(20)                                         /* (PORT_WRCONFIG) Output Driver Slew Rate Limit Enable Position */
#define PORT_WRCONFIG_SLEWLIM_Msk             (_UINT32_(0x1) << PORT_WRCONFIG_SLEWLIM_Pos)         /* (PORT_WRCONFIG) Output Driver Slew Rate Limit Enable Mask */
#define PORT_WRCONFIG_SLEWLIM(value)          (PORT_WRCONFIG_SLEWLIM_Msk & (_UINT32_(value) << PORT_WRCONFIG_SLEWLIM_Pos)) /* Assignment of value for SLEWLIM in the PORT_WRCONFIG register */
#define PORT_WRCONFIG_PMUX_Pos                _UINT32_(24)                                         /* (PORT_WRCONFIG) Peripheral Multiplexing Position */
#define PORT_WRCONFIG_PMUX_Msk                (_UINT32_(0xF) << PORT_WRCONFIG_PMUX_Pos)            /* (PORT_WRCONFIG) Peripheral Multiplexing Mask */
#define PORT_WRCONFIG_PMUX(value)             (PORT_WRCONFIG_PMUX_Msk & (_UINT32_(value) << PORT_WRCONFIG_PMUX_Pos)) /* Assignment of value for PMUX in the PORT_WRCONFIG register */
#define   PORT_WRCONFIG_PMUX_A_Val            _UINT32_(0x0)                                        /* (PORT_WRCONFIG) Peripheral function A selected  */
#define   PORT_WRCONFIG_PMUX_B_Val            _UINT32_(0x1)                                        /* (PORT_WRCONFIG) Peripheral function B selected  */
#define   PORT_WRCONFIG_PMUX_C_Val            _UINT32_(0x2)                                        /* (PORT_WRCONFIG) Peripheral function C selected  */
#define   PORT_WRCONFIG_PMUX_D_Val            _UINT32_(0x3)                                        /* (PORT_WRCONFIG) Peripheral function D selected  */
#define   PORT_WRCONFIG_PMUX_E_Val            _UINT32_(0x4)                                        /* (PORT_WRCONFIG) Peripheral function E selected  */
#define   PORT_WRCONFIG_PMUX_F_Val            _UINT32_(0x5)                                        /* (PORT_WRCONFIG) Peripheral function F selected  */
#define   PORT_WRCONFIG_PMUX_G_Val            _UINT32_(0x6)                                        /* (PORT_WRCONFIG) Peripheral function G selected  */
#define   PORT_WRCONFIG_PMUX_H_Val            _UINT32_(0x7)                                        /* (PORT_WRCONFIG) Peripheral function H selected  */
#define   PORT_WRCONFIG_PMUX_I_Val            _UINT32_(0x8)                                        /* (PORT_WRCONFIG) Peripheral function I selected  */
#define   PORT_WRCONFIG_PMUX_J_Val            _UINT32_(0x9)                                        /* (PORT_WRCONFIG) Peripheral function J selected  */
#define PORT_WRCONFIG_PMUX_A                  (PORT_WRCONFIG_PMUX_A_Val << PORT_WRCONFIG_PMUX_Pos) /* (PORT_WRCONFIG) Peripheral function A selected Position */
#define PORT_WRCONFIG_PMUX_B                  (PORT_WRCONFIG_PMUX_B_Val << PORT_WRCONFIG_PMUX_Pos) /* (PORT_WRCONFIG) Peripheral function B selected Position */
#define PORT_WRCONFIG_PMUX_C                  (PORT_WRCONFIG_PMUX_C_Val << PORT_WRCONFIG_PMUX_Pos) /* (PORT_WRCONFIG) Peripheral function C selected Position */
#define PORT_WRCONFIG_PMUX_D                  (PORT_WRCONFIG_PMUX_D_Val << PORT_WRCONFIG_PMUX_Pos) /* (PORT_WRCONFIG) Peripheral function D selected Position */
#define PORT_WRCONFIG_PMUX_E                  (PORT_WRCONFIG_PMUX_E_Val << PORT_WRCONFIG_PMUX_Pos) /* (PORT_WRCONFIG) Peripheral function E selected Position */
#define PORT_WRCONFIG_PMUX_F                  (PORT_WRCONFIG_PMUX_F_Val << PORT_WRCONFIG_PMUX_Pos) /* (PORT_WRCONFIG) Peripheral function F selected Position */
#define PORT_WRCONFIG_PMUX_G                  (PORT_WRCONFIG_PMUX_G_Val << PORT_WRCONFIG_PMUX_Pos) /* (PORT_WRCONFIG) Peripheral function G selected Position */
#define PORT_WRCONFIG_PMUX_H                  (PORT_WRCONFIG_PMUX_H_Val << PORT_WRCONFIG_PMUX_Pos) /* (PORT_WRCONFIG) Peripheral function H selected Position */
#define PORT_WRCONFIG_PMUX_I                  (PORT_WRCONFIG_PMUX_I_Val << PORT_WRCONFIG_PMUX_Pos) /* (PORT_WRCONFIG) Peripheral function I selected Position */
#define PORT_WRCONFIG_PMUX_J                  (PORT_WRCONFIG_PMUX_J_Val << PORT_WRCONFIG_PMUX_Pos) /* (PORT_WRCONFIG) Peripheral function J selected Position */
#define PORT_WRCONFIG_WRPMUX_Pos              _UINT32_(28)                                         /* (PORT_WRCONFIG) Write PMUX Position */
#define PORT_WRCONFIG_WRPMUX_Msk              (_UINT32_(0x1) << PORT_WRCONFIG_WRPMUX_Pos)          /* (PORT_WRCONFIG) Write PMUX Mask */
#define PORT_WRCONFIG_WRPMUX(value)           (PORT_WRCONFIG_WRPMUX_Msk & (_UINT32_(value) << PORT_WRCONFIG_WRPMUX_Pos)) /* Assignment of value for WRPMUX in the PORT_WRCONFIG register */
#define PORT_WRCONFIG_WRPINCFG_Pos            _UINT32_(30)                                         /* (PORT_WRCONFIG) Write PINCFG Position */
#define PORT_WRCONFIG_WRPINCFG_Msk            (_UINT32_(0x1) << PORT_WRCONFIG_WRPINCFG_Pos)        /* (PORT_WRCONFIG) Write PINCFG Mask */
#define PORT_WRCONFIG_WRPINCFG(value)         (PORT_WRCONFIG_WRPINCFG_Msk & (_UINT32_(value) << PORT_WRCONFIG_WRPINCFG_Pos)) /* Assignment of value for WRPINCFG in the PORT_WRCONFIG register */
#define PORT_WRCONFIG_HWSEL_Pos               _UINT32_(31)                                         /* (PORT_WRCONFIG) Half-Word Select Position */
#define PORT_WRCONFIG_HWSEL_Msk               (_UINT32_(0x1) << PORT_WRCONFIG_HWSEL_Pos)           /* (PORT_WRCONFIG) Half-Word Select Mask */
#define PORT_WRCONFIG_HWSEL(value)            (PORT_WRCONFIG_HWSEL_Msk & (_UINT32_(value) << PORT_WRCONFIG_HWSEL_Pos)) /* Assignment of value for HWSEL in the PORT_WRCONFIG register */
#define PORT_WRCONFIG_Msk                     _UINT32_(0xDF17FFFF)                                 /* (PORT_WRCONFIG) Register Mask  */


/* -------- PORT_EVCTRL : (PORT Offset: 0x2C) (R/W 32) Event Control -------- */
#define PORT_EVCTRL_RESETVALUE                _UINT32_(0x00)                                       /*  (PORT_EVCTRL) Event Control  Reset Value */

